graph(%self.1 : __torch__.models.mobilenetv2.___torch_mangle_283.MobileNetV2,
      %x.1 : Tensor):
  %2 : Function = prim::Constant[name="adaptive_avg_pool2d"]()
  %3 : int = prim::Constant[value=1]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:84:37
  %4 : int = prim::Constant[value=0]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:86:26
  %5 : int = prim::Constant[value=-1]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:86:30
  %pre.1 : __torch__.torch.nn.modules.container.___torch_mangle_225.Sequential = prim::GetAttr[name="pre"](%self.1)
  %29 : float = prim::Constant[value=0.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:33
  %30 : float = prim::Constant[value=6.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:47
  %31 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %32 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %33 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %34 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %35 : int = prim::Constant[value=0]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:22
  %36 : int = prim::Constant[value=2]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %37 : bool = prim::Constant[value=1]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %38 : int = prim::Constant[value=1]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:33
  %_0.9 : __torch__.torch.nn.modules.conv.___torch_mangle_222.Conv2d = prim::GetAttr[name="0"](%pre.1)
  %_1.15 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_223.BatchNorm2d = prim::GetAttr[name="1"](%pre.1)
  %weight.59 : Tensor = prim::GetAttr[name="weight"](%_0.9)
  %bias.59 : Tensor? = prim::GetAttr[name="bias"](%_0.9)
  %43 : int[] = prim::ListConstruct(%38, %38)
  %44 : int[] = prim::ListConstruct(%38, %38)
  %45 : int[] = prim::ListConstruct(%38, %38)
  %input0.7 : Tensor = aten::conv2d(%x.1, %weight.59, %bias.59, %43, %44, %45, %38) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.59 : bool = prim::GetAttr[name="training"](%_1.15)
   = prim::If(%training.59) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.31 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.15)
      %49 : Tensor = aten::add_(%num_batches_tracked.31, %38, %38) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.61 : bool = prim::GetAttr[name="training"](%_1.15)
  %running_mean.31 : Tensor = prim::GetAttr[name="running_mean"](%_1.15)
  %running_var.31 : Tensor = prim::GetAttr[name="running_var"](%_1.15)
  %weight.61 : Tensor = prim::GetAttr[name="weight"](%_1.15)
  %bias.61 : Tensor = prim::GetAttr[name="bias"](%_1.15)
   = prim::If(%training.61) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %55 : int[] = aten::size(%input0.7) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.31 : int = aten::__getitem__(%55, %35) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %57 : int = aten::len(%55) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %58 : int = aten::sub(%57, %36) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.63 : int = prim::Loop(%58, %37, %size_prods.31) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.31 : int, %size_prods0.65 : int):
          %62 : int = aten::add(%i.31, %36) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %63 : int = aten::__getitem__(%55, %62) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.31 : int = aten::mul(%size_prods0.65, %63) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%37, %size_prods1.31)
      %65 : bool = aten::eq(%size_prods0.63, %38) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%65) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %66 : str = aten::format(%34, %55) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%66, %33) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.6 : Tensor = aten::batch_norm(%input0.7, %weight.61, %bias.61, %running_mean.31, %running_var.31, %training.61, %31, %32, %37) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %x0.1 : Tensor = aten::hardtanh_(%input1.6, %29, %30) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %stage1.1 : __torch__.models.mobilenetv2.___torch_mangle_231.LinearBottleNeck = prim::GetAttr[name="stage1"](%self.1)
  %69 : int = prim::Constant[value=0]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %70 : bool = prim::Constant[value=1]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %71 : int = prim::Constant[value=2]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %72 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %73 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %74 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %75 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %76 : float = prim::Constant[value=6.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:47
  %77 : float = prim::Constant[value=0.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:33
  %78 : int = prim::Constant[value=32]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:75
  %79 : int = prim::Constant[value=1]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:26
  %80 : bool = prim::Constant[value=0]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %residual.10 : __torch__.torch.nn.modules.container.___torch_mangle_230.Sequential = prim::GetAttr[name="residual"](%stage1.1)
  %_0.17 : __torch__.torch.nn.modules.conv.___torch_mangle_226.Conv2d = prim::GetAttr[name="0"](%residual.10)
  %_1.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_223.BatchNorm2d = prim::GetAttr[name="1"](%residual.10)
  %_3.9 : __torch__.torch.nn.modules.conv.___torch_mangle_227.Conv2d = prim::GetAttr[name="3"](%residual.10)
  %_4.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_223.BatchNorm2d = prim::GetAttr[name="4"](%residual.10)
  %_6.9 : __torch__.torch.nn.modules.conv.___torch_mangle_228.Conv2d = prim::GetAttr[name="6"](%residual.10)
  %_7.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_229.BatchNorm2d = prim::GetAttr[name="7"](%residual.10)
  %weight.63 : Tensor = prim::GetAttr[name="weight"](%_0.17)
  %bias.63 : Tensor? = prim::GetAttr[name="bias"](%_0.17)
  %90 : int[] = prim::ListConstruct(%79, %79)
  %91 : int[] = prim::ListConstruct(%69, %69)
  %92 : int[] = prim::ListConstruct(%79, %79)
  %input0.4 : Tensor = aten::conv2d(%x0.1, %weight.63, %bias.63, %90, %91, %92, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.63 : bool = prim::GetAttr[name="training"](%_1.7)
   = prim::If(%training.63) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.33 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.7)
      %96 : Tensor = aten::add_(%num_batches_tracked.33, %79, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.65 : bool = prim::GetAttr[name="training"](%_1.7)
  %running_mean.33 : Tensor = prim::GetAttr[name="running_mean"](%_1.7)
  %running_var.33 : Tensor = prim::GetAttr[name="running_var"](%_1.7)
  %weight.65 : Tensor = prim::GetAttr[name="weight"](%_1.7)
  %bias.65 : Tensor = prim::GetAttr[name="bias"](%_1.7)
   = prim::If(%training.65) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %102 : int[] = aten::size(%input0.4) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.33 : int = aten::__getitem__(%102, %69) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %104 : int = aten::len(%102) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %105 : int = aten::sub(%104, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.67 : int = prim::Loop(%105, %70, %size_prods.33) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.33 : int, %size_prods0.69 : int):
          %109 : int = aten::add(%i.33, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %110 : int = aten::__getitem__(%102, %109) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.33 : int = aten::mul(%size_prods0.69, %110) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%70, %size_prods1.33)
      %112 : bool = aten::eq(%size_prods0.67, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%112) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %113 : str = aten::format(%72, %102) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%113, %73) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.10 : Tensor = aten::batch_norm(%input0.4, %weight.65, %bias.65, %running_mean.33, %running_var.33, %training.65, %75, %74, %70) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input2.10 : Tensor = aten::hardtanh_(%input1.10, %77, %76) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.27 : Tensor = prim::GetAttr[name="weight"](%_3.9)
  %bias.27 : Tensor? = prim::GetAttr[name="bias"](%_3.9)
  %118 : int[] = prim::ListConstruct(%79, %79)
  %119 : int[] = prim::ListConstruct(%79, %79)
  %120 : int[] = prim::ListConstruct(%79, %79)
  %input3.10 : Tensor = aten::conv2d(%input2.10, %weight.27, %bias.27, %118, %119, %120, %78) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.27 : bool = prim::GetAttr[name="training"](%_4.9)
   = prim::If(%training.27) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.15 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.9)
      %124 : Tensor = aten::add_(%num_batches_tracked.15, %79, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.29 : bool = prim::GetAttr[name="training"](%_4.9)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%_4.9)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%_4.9)
  %weight.29 : Tensor = prim::GetAttr[name="weight"](%_4.9)
  %bias.29 : Tensor = prim::GetAttr[name="bias"](%_4.9)
   = prim::If(%training.29) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %130 : int[] = aten::size(%input3.10) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.15 : int = aten::__getitem__(%130, %69) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %132 : int = aten::len(%130) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %133 : int = aten::sub(%132, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.31 : int = prim::Loop(%133, %70, %size_prods.15) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.15 : int, %size_prods0.33 : int):
          %137 : int = aten::add(%i.15, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %138 : int = aten::__getitem__(%130, %137) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.15 : int = aten::mul(%size_prods0.33, %138) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%70, %size_prods1.15)
      %140 : bool = aten::eq(%size_prods0.31, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%140) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %141 : str = aten::format(%72, %130) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%141, %73) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input4.10 : Tensor = aten::batch_norm(%input3.10, %weight.29, %bias.29, %running_mean.15, %running_var.15, %training.29, %75, %74, %70) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input5.10 : Tensor = aten::hardtanh_(%input4.10, %77, %76) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.55 : Tensor = prim::GetAttr[name="weight"](%_6.9)
  %bias.55 : Tensor? = prim::GetAttr[name="bias"](%_6.9)
  %146 : int[] = prim::ListConstruct(%79, %79)
  %147 : int[] = prim::ListConstruct(%69, %69)
  %148 : int[] = prim::ListConstruct(%79, %79)
  %input6.10 : Tensor = aten::conv2d(%input5.10, %weight.55, %bias.55, %146, %147, %148, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.55 : bool = prim::GetAttr[name="training"](%_7.9)
   = prim::If(%training.55) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.29 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_7.9)
      %152 : Tensor = aten::add_(%num_batches_tracked.29, %79, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.57 : bool = prim::GetAttr[name="training"](%_7.9)
  %running_mean.29 : Tensor = prim::GetAttr[name="running_mean"](%_7.9)
  %running_var.29 : Tensor = prim::GetAttr[name="running_var"](%_7.9)
  %weight.57 : Tensor = prim::GetAttr[name="weight"](%_7.9)
  %bias.57 : Tensor = prim::GetAttr[name="bias"](%_7.9)
   = prim::If(%training.57) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %158 : int[] = aten::size(%input6.10) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.29 : int = aten::__getitem__(%158, %69) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %160 : int = aten::len(%158) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %161 : int = aten::sub(%160, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.59 : int = prim::Loop(%161, %70, %size_prods.29) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.29 : int, %size_prods0.61 : int):
          %165 : int = aten::add(%i.29, %71) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %166 : int = aten::__getitem__(%158, %165) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.29 : int = aten::mul(%size_prods0.61, %166) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%70, %size_prods1.29)
      %168 : bool = aten::eq(%size_prods0.59, %79) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%168) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %169 : str = aten::format(%72, %158) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%169, %73) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %residual0.10 : Tensor = aten::batch_norm(%input6.10, %weight.57, %bias.57, %running_mean.29, %running_var.29, %training.57, %75, %74, %70) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %stride.10 : int = prim::GetAttr[name="stride"](%stage1.1)
  %172 : bool = aten::eq(%stride.10, %79) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %173 : bool = prim::If(%172) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
    block0():
      %in_channels.10 : int = prim::GetAttr[name="in_channels"](%stage1.1)
      %out_channels.10 : int = prim::GetAttr[name="out_channels"](%stage1.1)
      %176 : bool = aten::eq(%in_channels.10, %out_channels.10) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:32
      -> (%176)
    block1():
      -> (%80)
  %x1.1 : Tensor = prim::If(%173) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:8
    block0():
      %residual1.10 : Tensor = aten::add_(%residual0.10, %x0.1, %79) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:43:12
      -> (%residual1.10)
    block1():
      -> (%residual0.10)
  %stage2.1 : __torch__.torch.nn.modules.container.___torch_mangle_239.Sequential = prim::GetAttr[name="stage2"](%self.1)
  %179 : bool = prim::Constant[value=0]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %180 : int = prim::Constant[value=1]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:26
  %181 : int = prim::Constant[value=48]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:75
  %182 : float = prim::Constant[value=0.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:33
  %183 : float = prim::Constant[value=6.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:47
  %184 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %185 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %186 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %187 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %188 : int = prim::Constant[value=2]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %189 : bool = prim::Constant[value=1]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %190 : int = prim::Constant[value=0]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %_0.7 : __torch__.models.mobilenetv2.___torch_mangle_238.LinearBottleNeck = prim::GetAttr[name="0"](%stage2.1)
  %residual.6 : __torch__.torch.nn.modules.container.___torch_mangle_237.Sequential = prim::GetAttr[name="residual"](%_0.7)
  %_0.11 : __torch__.torch.nn.modules.conv.___torch_mangle_232.Conv2d = prim::GetAttr[name="0"](%residual.6)
  %_1.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_233.BatchNorm2d = prim::GetAttr[name="1"](%residual.6)
  %_3.5 : __torch__.torch.nn.modules.conv.___torch_mangle_234.Conv2d = prim::GetAttr[name="3"](%residual.6)
  %_4.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_233.BatchNorm2d = prim::GetAttr[name="4"](%residual.6)
  %_6.5 : __torch__.torch.nn.modules.conv.___torch_mangle_235.Conv2d = prim::GetAttr[name="6"](%residual.6)
  %_7.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_236.BatchNorm2d = prim::GetAttr[name="7"](%residual.6)
  %weight.31 : Tensor = prim::GetAttr[name="weight"](%_0.11)
  %bias.31 : Tensor? = prim::GetAttr[name="bias"](%_0.11)
  %201 : int[] = prim::ListConstruct(%180, %180)
  %202 : int[] = prim::ListConstruct(%190, %190)
  %203 : int[] = prim::ListConstruct(%180, %180)
  %input0.9 : Tensor = aten::conv2d(%x1.1, %weight.31, %bias.31, %201, %202, %203, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.31 : bool = prim::GetAttr[name="training"](%_1.9)
   = prim::If(%training.31) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.17 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.9)
      %207 : Tensor = aten::add_(%num_batches_tracked.17, %180, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.33 : bool = prim::GetAttr[name="training"](%_1.9)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%_1.9)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%_1.9)
  %weight.33 : Tensor = prim::GetAttr[name="weight"](%_1.9)
  %bias.33 : Tensor = prim::GetAttr[name="bias"](%_1.9)
   = prim::If(%training.33) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %213 : int[] = aten::size(%input0.9) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.17 : int = aten::__getitem__(%213, %190) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %215 : int = aten::len(%213) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %216 : int = aten::sub(%215, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.35 : int = prim::Loop(%216, %189, %size_prods.17) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.17 : int, %size_prods0.37 : int):
          %220 : int = aten::add(%i.17, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %221 : int = aten::__getitem__(%213, %220) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.17 : int = aten::mul(%size_prods0.37, %221) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%189, %size_prods1.17)
      %223 : bool = aten::eq(%size_prods0.35, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%223) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %224 : str = aten::format(%187, %213) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%224, %186) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.12 : Tensor = aten::batch_norm(%input0.9, %weight.33, %bias.33, %running_mean.17, %running_var.17, %training.33, %184, %185, %189) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input2.6 : Tensor = aten::hardtanh_(%input1.12, %182, %183) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.35 : Tensor = prim::GetAttr[name="weight"](%_3.5)
  %bias.35 : Tensor? = prim::GetAttr[name="bias"](%_3.5)
  %229 : int[] = prim::ListConstruct(%188, %188)
  %230 : int[] = prim::ListConstruct(%180, %180)
  %231 : int[] = prim::ListConstruct(%180, %180)
  %input3.6 : Tensor = aten::conv2d(%input2.6, %weight.35, %bias.35, %229, %230, %231, %181) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.35 : bool = prim::GetAttr[name="training"](%_4.5)
   = prim::If(%training.35) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.19 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.5)
      %235 : Tensor = aten::add_(%num_batches_tracked.19, %180, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.37 : bool = prim::GetAttr[name="training"](%_4.5)
  %running_mean.19 : Tensor = prim::GetAttr[name="running_mean"](%_4.5)
  %running_var.19 : Tensor = prim::GetAttr[name="running_var"](%_4.5)
  %weight.37 : Tensor = prim::GetAttr[name="weight"](%_4.5)
  %bias.37 : Tensor = prim::GetAttr[name="bias"](%_4.5)
   = prim::If(%training.37) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %241 : int[] = aten::size(%input3.6) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.19 : int = aten::__getitem__(%241, %190) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %243 : int = aten::len(%241) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %244 : int = aten::sub(%243, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.39 : int = prim::Loop(%244, %189, %size_prods.19) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.19 : int, %size_prods0.41 : int):
          %248 : int = aten::add(%i.19, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %249 : int = aten::__getitem__(%241, %248) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.19 : int = aten::mul(%size_prods0.41, %249) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%189, %size_prods1.19)
      %251 : bool = aten::eq(%size_prods0.39, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%251) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %252 : str = aten::format(%187, %241) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%252, %186) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input4.6 : Tensor = aten::batch_norm(%input3.6, %weight.37, %bias.37, %running_mean.19, %running_var.19, %training.37, %184, %185, %189) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input5.6 : Tensor = aten::hardtanh_(%input4.6, %182, %183) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.39 : Tensor = prim::GetAttr[name="weight"](%_6.5)
  %bias.39 : Tensor? = prim::GetAttr[name="bias"](%_6.5)
  %257 : int[] = prim::ListConstruct(%180, %180)
  %258 : int[] = prim::ListConstruct(%190, %190)
  %259 : int[] = prim::ListConstruct(%180, %180)
  %input6.6 : Tensor = aten::conv2d(%input5.6, %weight.39, %bias.39, %257, %258, %259, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.39 : bool = prim::GetAttr[name="training"](%_7.5)
   = prim::If(%training.39) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.21 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_7.5)
      %263 : Tensor = aten::add_(%num_batches_tracked.21, %180, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.41 : bool = prim::GetAttr[name="training"](%_7.5)
  %running_mean.21 : Tensor = prim::GetAttr[name="running_mean"](%_7.5)
  %running_var.21 : Tensor = prim::GetAttr[name="running_var"](%_7.5)
  %weight.41 : Tensor = prim::GetAttr[name="weight"](%_7.5)
  %bias.41 : Tensor = prim::GetAttr[name="bias"](%_7.5)
   = prim::If(%training.41) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %269 : int[] = aten::size(%input6.6) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.21 : int = aten::__getitem__(%269, %190) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %271 : int = aten::len(%269) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %272 : int = aten::sub(%271, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.43 : int = prim::Loop(%272, %189, %size_prods.21) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.21 : int, %size_prods0.45 : int):
          %276 : int = aten::add(%i.21, %188) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %277 : int = aten::__getitem__(%269, %276) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.21 : int = aten::mul(%size_prods0.45, %277) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%189, %size_prods1.21)
      %279 : bool = aten::eq(%size_prods0.43, %180) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%279) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %280 : str = aten::format(%187, %269) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%280, %186) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %residual0.6 : Tensor = aten::batch_norm(%input6.6, %weight.41, %bias.41, %running_mean.21, %running_var.21, %training.41, %184, %185, %189) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %stride.6 : int = prim::GetAttr[name="stride"](%_0.7)
  %283 : bool = aten::eq(%stride.6, %180) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %284 : bool = prim::If(%283) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
    block0():
      %in_channels.6 : int = prim::GetAttr[name="in_channels"](%_0.7)
      %out_channels.6 : int = prim::GetAttr[name="out_channels"](%_0.7)
      %287 : bool = aten::eq(%in_channels.6, %out_channels.6) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:32
      -> (%287)
    block1():
      -> (%179)
  %x2.1 : Tensor = prim::If(%284) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:8
    block0():
      %residual1.6 : Tensor = aten::add_(%residual0.6, %x1.1, %180) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:43:12
      -> (%residual1.6)
    block1():
      -> (%residual0.6)
  %stage3.1 : __torch__.torch.nn.modules.container.___torch_mangle_252.Sequential = prim::GetAttr[name="stage3"](%self.1)
  %290 : int = prim::Constant[value=96]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:75
  %291 : bool = prim::Constant[value=0]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %292 : int = prim::Constant[value=1]() # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:26
  %293 : int = prim::Constant[value=72]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:75
  %294 : float = prim::Constant[value=0.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:33
  %295 : float = prim::Constant[value=6.]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/activation.py:269:47
  %296 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %297 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %298 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %299 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %300 : int = prim::Constant[value=2]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %301 : bool = prim::Constant[value=1]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %302 : int = prim::Constant[value=0]() # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %_0.13 : __torch__.models.mobilenetv2.___torch_mangle_245.LinearBottleNeck = prim::GetAttr[name="0"](%stage3.1)
  %_1.11 : __torch__.models.mobilenetv2.___torch_mangle_251.LinearBottleNeck = prim::GetAttr[name="1"](%stage3.1)
  %residual.8 : __torch__.torch.nn.modules.container.___torch_mangle_244.Sequential = prim::GetAttr[name="residual"](%_0.13)
  %_0.15 : __torch__.torch.nn.modules.conv.___torch_mangle_240.Conv2d = prim::GetAttr[name="0"](%residual.8)
  %_1.13 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_241.BatchNorm2d = prim::GetAttr[name="1"](%residual.8)
  %_3.7 : __torch__.torch.nn.modules.conv.___torch_mangle_242.Conv2d = prim::GetAttr[name="3"](%residual.8)
  %_4.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_241.BatchNorm2d = prim::GetAttr[name="4"](%residual.8)
  %_6.7 : __torch__.torch.nn.modules.conv.___torch_mangle_243.Conv2d = prim::GetAttr[name="6"](%residual.8)
  %_7.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_223.BatchNorm2d = prim::GetAttr[name="7"](%residual.8)
  %weight.43 : Tensor = prim::GetAttr[name="weight"](%_0.15)
  %bias.43 : Tensor? = prim::GetAttr[name="bias"](%_0.15)
  %314 : int[] = prim::ListConstruct(%292, %292)
  %315 : int[] = prim::ListConstruct(%302, %302)
  %316 : int[] = prim::ListConstruct(%292, %292)
  %input0.11 : Tensor = aten::conv2d(%x2.1, %weight.43, %bias.43, %314, %315, %316, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.43 : bool = prim::GetAttr[name="training"](%_1.13)
   = prim::If(%training.43) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.23 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.13)
      %320 : Tensor = aten::add_(%num_batches_tracked.23, %292, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.45 : bool = prim::GetAttr[name="training"](%_1.13)
  %running_mean.23 : Tensor = prim::GetAttr[name="running_mean"](%_1.13)
  %running_var.23 : Tensor = prim::GetAttr[name="running_var"](%_1.13)
  %weight.45 : Tensor = prim::GetAttr[name="weight"](%_1.13)
  %bias.45 : Tensor = prim::GetAttr[name="bias"](%_1.13)
   = prim::If(%training.45) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %326 : int[] = aten::size(%input0.11) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.23 : int = aten::__getitem__(%326, %302) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %328 : int = aten::len(%326) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %329 : int = aten::sub(%328, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.47 : int = prim::Loop(%329, %301, %size_prods.23) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.23 : int, %size_prods0.49 : int):
          %333 : int = aten::add(%i.23, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %334 : int = aten::__getitem__(%326, %333) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.23 : int = aten::mul(%size_prods0.49, %334) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%301, %size_prods1.23)
      %336 : bool = aten::eq(%size_prods0.47, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%336) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %337 : str = aten::format(%299, %326) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%337, %298) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.14 : Tensor = aten::batch_norm(%input0.11, %weight.45, %bias.45, %running_mean.23, %running_var.23, %training.45, %296, %297, %301) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input2.8 : Tensor = aten::hardtanh_(%input1.14, %294, %295) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.47 : Tensor = prim::GetAttr[name="weight"](%_3.7)
  %bias.47 : Tensor? = prim::GetAttr[name="bias"](%_3.7)
  %342 : int[] = prim::ListConstruct(%300, %300)
  %343 : int[] = prim::ListConstruct(%292, %292)
  %344 : int[] = prim::ListConstruct(%292, %292)
  %input3.8 : Tensor = aten::conv2d(%input2.8, %weight.47, %bias.47, %342, %343, %344, %293) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.47 : bool = prim::GetAttr[name="training"](%_4.7)
   = prim::If(%training.47) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.25 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.7)
      %348 : Tensor = aten::add_(%num_batches_tracked.25, %292, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.49 : bool = prim::GetAttr[name="training"](%_4.7)
  %running_mean.25 : Tensor = prim::GetAttr[name="running_mean"](%_4.7)
  %running_var.25 : Tensor = prim::GetAttr[name="running_var"](%_4.7)
  %weight.49 : Tensor = prim::GetAttr[name="weight"](%_4.7)
  %bias.49 : Tensor = prim::GetAttr[name="bias"](%_4.7)
   = prim::If(%training.49) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %354 : int[] = aten::size(%input3.8) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.25 : int = aten::__getitem__(%354, %302) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %356 : int = aten::len(%354) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %357 : int = aten::sub(%356, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.51 : int = prim::Loop(%357, %301, %size_prods.25) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.25 : int, %size_prods0.53 : int):
          %361 : int = aten::add(%i.25, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %362 : int = aten::__getitem__(%354, %361) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.25 : int = aten::mul(%size_prods0.53, %362) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%301, %size_prods1.25)
      %364 : bool = aten::eq(%size_prods0.51, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%364) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %365 : str = aten::format(%299, %354) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%365, %298) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input4.8 : Tensor = aten::batch_norm(%input3.8, %weight.49, %bias.49, %running_mean.25, %running_var.25, %training.49, %296, %297, %301) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input5.8 : Tensor = aten::hardtanh_(%input4.8, %294, %295) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:1764:17
  %weight.51 : Tensor = prim::GetAttr[name="weight"](%_6.7)
  %bias.51 : Tensor? = prim::GetAttr[name="bias"](%_6.7)
  %370 : int[] = prim::ListConstruct(%292, %292)
  %371 : int[] = prim::ListConstruct(%302, %302)
  %372 : int[] = prim::ListConstruct(%292, %292)
  %input6.8 : Tensor = aten::conv2d(%input5.8, %weight.51, %bias.51, %370, %371, %372, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.51 : bool = prim::GetAttr[name="training"](%_7.7)
   = prim::If(%training.51) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.27 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_7.7)
      %376 : Tensor = aten::add_(%num_batches_tracked.27, %292, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.53 : bool = prim::GetAttr[name="training"](%_7.7)
  %running_mean.27 : Tensor = prim::GetAttr[name="running_mean"](%_7.7)
  %running_var.27 : Tensor = prim::GetAttr[name="running_var"](%_7.7)
  %weight.53 : Tensor = prim::GetAttr[name="weight"](%_7.7)
  %bias.53 : Tensor = prim::GetAttr[name="bias"](%_7.7)
   = prim::If(%training.53) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %382 : int[] = aten::size(%input6.8) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.27 : int = aten::__getitem__(%382, %302) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %384 : int = aten::len(%382) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %385 : int = aten::sub(%384, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.55 : int = prim::Loop(%385, %301, %size_prods.27) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.27 : int, %size_prods0.57 : int):
          %389 : int = aten::add(%i.27, %300) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %390 : int = aten::__getitem__(%382, %389) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.27 : int = aten::mul(%size_prods0.57, %390) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%301, %size_prods1.27)
      %392 : bool = aten::eq(%size_prods0.55, %292) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%392) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %393 : str = aten::format(%299, %382) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%393, %298) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %residual0.8 : Tensor = aten::batch_norm(%input6.8, %weight.53, %bias.53, %running_mean.27, %running_var.27, %training.53, %296, %297, %301) # /workspace/mein_naschain/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %stride.8 : int = prim::GetAttr[name="stride"](%_0.13)
  %396 : bool = aten::eq(%stride.8, %292) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
  %397 : bool = prim::If(%396) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:11
    block0():
      %in_channels.8 : int = prim::GetAttr[name="in_channels"](%_0.13)
      %out_channels.8 : int = prim::GetAttr[name="out_channels"](%_0.13)
      %400 : bool = aten::eq(%in_channels.8, %out_channels.8) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:32
      -> (%400)
    block1():
      -> (%291)
  %input0.13 : Tensor = prim::If(%397) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:42:8
    block0():
      %residual1.8 : Tensor = aten::add_(%residual0.8, %x2.1, %292) # /workspace/mein_naschain/weiaicunzai/models/mobilenetv2.py:43:12
      -> (%residual1.8)
    block1():
      -> (%residual0.8)
  %residual.12 : __torch__.torch.nn.modules.container.___torch_mangle_250.Sequential = prim::GetAttr[name="residual"](%_1.11)
  %_0.19 : __torch__.torch.nn.modules.conv.___torch_mangle_246.Conv2d = prim::GetAttr[name="0"](%residual.12)
  %_1.17 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_247.BatchNorm2d = prim::GetAttr[name="1"](%residual.12)
  %_3.11 : __torch__.torch.nn.modules.conv.___torch_mangle_248.Conv2d = prim::GetAttr[name="3"](%residual.12)
  %_4.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_247.BatchNorm2d = prim::GetAttr[name="4"](%residual.12)
  %_6.11 : __torch__.torch.nn.modules.conv.___torch_mangle_249.Conv2d = prim::GetAttr[name="6"](%residual.12)
