graph(%self.1 : __torch__.___torch_mangle_150.SimpleCNN,
      %x.1 : Tensor):
  %2 : NoneType = prim::Constant()
  %3 : bool = prim::Constant[value=0]()
  %4 : int = prim::Constant[value=2]() # /home/auto_update_valid_train.py:299:24
  %5 : int = prim::Constant[value=3]() # /home/auto_update_valid_train.py:299:27
  %stem.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="stem"](%self.1)
  %16 : str = prim::Constant[value="none"]()
  %17 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %18 : float = prim::Constant[value=1.0000000000000001e-05]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:204:12
  %19 : str = prim::Constant[value="builtins.ValueError"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:452:18
  %20 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
  %21 : int = prim::Constant[value=2]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:31
  %22 : bool = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2821:8
  %23 : int = prim::Constant[value=0]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:46
  %24 : int = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:33
  %_0.5 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="0"](%stem.1)
  %_1.5 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%stem.1)
  %weight.15 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %bias.15 : Tensor? = prim::GetAttr[name="bias"](%_0.5)
  %29 : int[] = prim::ListConstruct(%24, %24)
  %30 : int[] = prim::ListConstruct(%23, %23)
  %31 : int[] = prim::ListConstruct(%24, %24)
  %input0.5 : Tensor = aten::conv2d(%x.1, %weight.15, %bias.15, %29, %30, %31, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.10 : bool = prim::GetAttr[name="training"](%_1.5)
   = prim::If(%training.10) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.6 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.5)
      %35 : Tensor = aten::add_(%num_batches_tracked.6, %24, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.12 : bool = prim::GetAttr[name="training"](%_1.5)
  %running_mean.6 : Tensor = prim::GetAttr[name="running_mean"](%_1.5)
  %running_var.6 : Tensor = prim::GetAttr[name="running_var"](%_1.5)
  %weight.17 : Tensor = prim::GetAttr[name="weight"](%_1.5)
  %bias.17 : Tensor = prim::GetAttr[name="bias"](%_1.5)
   = prim::If(%training.12) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %41 : int[] = aten::size(%input0.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.6 : int = aten::__getitem__(%41, %23) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %43 : int = aten::len(%41) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %44 : int = aten::sub(%43, %21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.3 : int = prim::Loop(%44, %22, %size_prods.6) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.6 : int, %size_prods0.14 : int):
          %48 : int = aten::add(%i.6, %21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %49 : int = aten::__getitem__(%41, %48) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.6 : int = aten::mul(%size_prods0.14, %49) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%22, %size_prods1.6)
      %51 : bool = aten::eq(%size_prods0.3, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%51) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %52 : str = aten::format(%20, %41) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%52, %19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.3 : Tensor = aten::batch_norm(%input0.5, %weight.17, %bias.17, %running_mean.6, %running_var.6, %training.12, %17, %18, %22) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %x0.1 : Tensor = aten::gelu(%input1.3, %16) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %blocks.1 : __torch__.torch.nn.modules.container.___torch_mangle_149.Sequential = prim::GetAttr[name="blocks"](%self.1)
  %55 : int = prim::Constant[value=336]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %56 : int = prim::Constant[value=384]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %57 : int = prim::Constant[value=192]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %58 : int = prim::Constant[value=120]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %59 : int = prim::Constant[value=80]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %60 : int = prim::Constant[value=1]()
  %61 : str = prim::Constant[value="none"]()
  %62 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %63 : float = prim::Constant[value=1.0000000000000001e-05]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:204:12
  %64 : str = prim::Constant[value="builtins.ValueError"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:452:18
  %65 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
  %66 : int = prim::Constant[value=0]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:22
  %67 : int = prim::Constant[value=2]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:31
  %68 : bool = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2821:8
  %69 : int = prim::Constant[value=16]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %70 : int = prim::Constant[value=3]() # /home/auto_update_valid_train.py:37:27
  %71 : NoneType = prim::Constant()
  %_0.2 : __torch__.ConvBlock = prim::GetAttr[name="0"](%blocks.1)
  %_1.2 : __torch__.ConvBlock = prim::GetAttr[name="1"](%blocks.1)
  %_2 : __torch__.ConvBlock = prim::GetAttr[name="2"](%blocks.1)
  %_3 : __torch__.ConvBlock = prim::GetAttr[name="3"](%blocks.1)
  %_4 : __torch__.___torch_mangle_132.ConvBlock = prim::GetAttr[name="4"](%blocks.1)
  %_5 : __torch__.___torch_mangle_136.ConvBlock = prim::GetAttr[name="5"](%blocks.1)
  %_6 : __torch__.___torch_mangle_136.ConvBlock = prim::GetAttr[name="6"](%blocks.1)
  %_7 : __torch__.___torch_mangle_140.ConvBlock = prim::GetAttr[name="7"](%blocks.1)
  %_8 : __torch__.___torch_mangle_144.ConvBlock = prim::GetAttr[name="8"](%blocks.1)
  %_9 : __torch__.___torch_mangle_148.ConvBlock = prim::GetAttr[name="9"](%blocks.1)
  %expand_conv.2 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="expand_conv"](%_0.2)
  %depthwise_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_1.Sequential = prim::GetAttr[name="depthwise_conv"](%_0.2)
  %_0.4 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.2)
  %_1.4 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.2)
  %weight.4 : Tensor = prim::GetAttr[name="weight"](%_0.4)
  %bias.4 : Tensor? = prim::GetAttr[name="bias"](%_0.4)
  %88 : int[] = prim::ListConstruct(%60, %60)
  %89 : int[] = prim::ListConstruct(%60, %60)
  %90 : int[] = prim::ListConstruct(%60, %60)
  %input0.7 : Tensor = aten::conv2d(%x0.1, %weight.4, %bias.4, %88, %89, %90, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.3 : bool = prim::GetAttr[name="training"](%_1.4)
   = prim::If(%training.3) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.3 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.4)
      %94 : Tensor = aten::add_(%num_batches_tracked.3, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.5 : bool = prim::GetAttr[name="training"](%_1.4)
  %running_mean.3 : Tensor = prim::GetAttr[name="running_mean"](%_1.4)
  %running_var.3 : Tensor = prim::GetAttr[name="running_var"](%_1.4)
  %weight.6 : Tensor = prim::GetAttr[name="weight"](%_1.4)
  %bias.6 : Tensor = prim::GetAttr[name="bias"](%_1.4)
   = prim::If(%training.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %100 : int[] = aten::size(%input0.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.3 : int = aten::__getitem__(%100, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %102 : int = aten::len(%100) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %103 : int = aten::sub(%102, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.2 : int = prim::Loop(%103, %68, %size_prods.3) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.3 : int, %size_prods0.9 : int):
          %107 : int = aten::add(%i.3, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %108 : int = aten::__getitem__(%100, %107) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.3 : int = aten::mul(%size_prods0.9, %108) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.3)
      %110 : bool = aten::eq(%size_prods0.2, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%110) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %111 : str = aten::format(%65, %100) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%111, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.4 : Tensor = aten::batch_norm(%input0.7, %weight.6, %bias.6, %running_mean.3, %running_var.3, %training.5, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.2 : Tensor = aten::gelu(%input1.4, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %se.2 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_0.2)
  %115 : int[] = prim::ListConstruct(%67, %70)
  %y.2 : Tensor = aten::mean(%out0.2, %115, %68, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.2 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc1"](%se.2)
  %weight.8 : Tensor = prim::GetAttr[name="weight"](%fc1.2)
  %bias.8 : Tensor? = prim::GetAttr[name="bias"](%fc1.2)
  %120 : int[] = prim::ListConstruct(%60, %60)
  %121 : int[] = prim::ListConstruct(%66, %66)
  %122 : int[] = prim::ListConstruct(%60, %60)
  %y0.2 : Tensor = aten::conv2d(%y.2, %weight.8, %bias.8, %120, %121, %122, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act1.2 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.2)
  %y1.2 : Tensor = aten::gelu(%y0.2, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %fc2.2 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc2"](%se.2)
  %weight.10 : Tensor = prim::GetAttr[name="weight"](%fc2.2)
  %bias.10 : Tensor? = prim::GetAttr[name="bias"](%fc2.2)
  %129 : int[] = prim::ListConstruct(%60, %60)
  %130 : int[] = prim::ListConstruct(%66, %66)
  %131 : int[] = prim::ListConstruct(%60, %60)
  %y2.2 : Tensor = aten::conv2d(%y1.2, %weight.10, %bias.10, %129, %130, %131, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act2.2 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.2)
  %y3.2 : Tensor = aten::sigmoid(%y2.2) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:327:15
  %out1.2 : Tensor = aten::mul(%out0.2, %y3.2) # /home/auto_update_valid_train.py:42:15
  %project_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_3.Sequential = prim::GetAttr[name="project_conv"](%_0.2)
  %_0.6 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="0"](%project_conv.2)
  %_1.6 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.2)
  %weight.12 : Tensor = prim::GetAttr[name="weight"](%_0.6)
  %bias.12 : Tensor? = prim::GetAttr[name="bias"](%_0.6)
  %141 : int[] = prim::ListConstruct(%60, %60)
  %142 : int[] = prim::ListConstruct(%66, %66)
  %143 : int[] = prim::ListConstruct(%60, %60)
  %input0.9 : Tensor = aten::conv2d(%out1.2, %weight.12, %bias.12, %141, %142, %143, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.7 : bool = prim::GetAttr[name="training"](%_1.6)
   = prim::If(%training.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.5 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.6)
      %147 : Tensor = aten::add_(%num_batches_tracked.5, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.9 : bool = prim::GetAttr[name="training"](%_1.6)
  %running_mean.5 : Tensor = prim::GetAttr[name="running_mean"](%_1.6)
  %running_var.5 : Tensor = prim::GetAttr[name="running_var"](%_1.6)
  %weight.14 : Tensor = prim::GetAttr[name="weight"](%_1.6)
  %bias.14 : Tensor = prim::GetAttr[name="bias"](%_1.6)
   = prim::If(%training.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %153 : int[] = aten::size(%input0.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.5 : int = aten::__getitem__(%153, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %155 : int = aten::len(%153) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %156 : int = aten::sub(%155, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.11 : int = prim::Loop(%156, %68, %size_prods.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.5 : int, %size_prods0.13 : int):
          %160 : int = aten::add(%i.5, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %161 : int = aten::__getitem__(%153, %160) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.5 : int = aten::mul(%size_prods0.13, %161) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.5)
      %163 : bool = aten::eq(%size_prods0.11, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%163) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %164 : str = aten::format(%65, %153) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%164, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.2 : Tensor = aten::batch_norm(%input0.9, %weight.14, %bias.14, %running_mean.5, %running_var.5, %training.9, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.2 : bool = prim::GetAttr[name="use_residual"](%_0.2)
  %input0.3 : Tensor = prim::If(%use_residual.2) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.2 : Tensor = aten::add(%out2.2, %x0.1, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.2)
    block1():
      -> (%out2.2)
  %expand_conv.4 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="expand_conv"](%_1.2)
  %depthwise_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_1.Sequential = prim::GetAttr[name="depthwise_conv"](%_1.2)
  %_0.8 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.4)
  %_1.8 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.4)
  %weight.16 : Tensor = prim::GetAttr[name="weight"](%_0.8)
  %bias.16 : Tensor? = prim::GetAttr[name="bias"](%_0.8)
  %175 : int[] = prim::ListConstruct(%60, %60)
  %176 : int[] = prim::ListConstruct(%60, %60)
  %177 : int[] = prim::ListConstruct(%60, %60)
  %input0.11 : Tensor = aten::conv2d(%input0.3, %weight.16, %bias.16, %175, %176, %177, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.11 : bool = prim::GetAttr[name="training"](%_1.8)
   = prim::If(%training.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.7 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.8)
      %181 : Tensor = aten::add_(%num_batches_tracked.7, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.13 : bool = prim::GetAttr[name="training"](%_1.8)
  %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%_1.8)
  %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%_1.8)
  %weight.18 : Tensor = prim::GetAttr[name="weight"](%_1.8)
  %bias.18 : Tensor = prim::GetAttr[name="bias"](%_1.8)
   = prim::If(%training.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %187 : int[] = aten::size(%input0.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.7 : int = aten::__getitem__(%187, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %189 : int = aten::len(%187) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %190 : int = aten::sub(%189, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.15 : int = prim::Loop(%190, %68, %size_prods.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.7 : int, %size_prods0.17 : int):
          %194 : int = aten::add(%i.7, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %195 : int = aten::__getitem__(%187, %194) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.7 : int = aten::mul(%size_prods0.17, %195) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.7)
      %197 : bool = aten::eq(%size_prods0.15, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%197) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %198 : str = aten::format(%65, %187) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%198, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.8 : Tensor = aten::batch_norm(%input0.11, %weight.18, %bias.18, %running_mean.7, %running_var.7, %training.13, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.4 : Tensor = aten::gelu(%input1.8, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %se.4 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_1.2)
  %202 : int[] = prim::ListConstruct(%67, %70)
  %y.4 : Tensor = aten::mean(%out0.4, %202, %68, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.4 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc1"](%se.4)
  %weight.20 : Tensor = prim::GetAttr[name="weight"](%fc1.4)
  %bias.20 : Tensor? = prim::GetAttr[name="bias"](%fc1.4)
  %207 : int[] = prim::ListConstruct(%60, %60)
  %208 : int[] = prim::ListConstruct(%66, %66)
  %209 : int[] = prim::ListConstruct(%60, %60)
  %y0.4 : Tensor = aten::conv2d(%y.4, %weight.20, %bias.20, %207, %208, %209, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act1.4 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.4)
  %y1.4 : Tensor = aten::gelu(%y0.4, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %fc2.4 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc2"](%se.4)
  %weight.22 : Tensor = prim::GetAttr[name="weight"](%fc2.4)
  %bias.22 : Tensor? = prim::GetAttr[name="bias"](%fc2.4)
  %216 : int[] = prim::ListConstruct(%60, %60)
  %217 : int[] = prim::ListConstruct(%66, %66)
  %218 : int[] = prim::ListConstruct(%60, %60)
  %y2.4 : Tensor = aten::conv2d(%y1.4, %weight.22, %bias.22, %216, %217, %218, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act2.4 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.4)
  %y3.4 : Tensor = aten::sigmoid(%y2.4) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:327:15
  %out1.4 : Tensor = aten::mul(%out0.4, %y3.4) # /home/auto_update_valid_train.py:42:15
  %project_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_3.Sequential = prim::GetAttr[name="project_conv"](%_1.2)
  %_0.10 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="0"](%project_conv.4)
  %_1.10 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.4)
  %weight.24 : Tensor = prim::GetAttr[name="weight"](%_0.10)
  %bias.24 : Tensor? = prim::GetAttr[name="bias"](%_0.10)
  %228 : int[] = prim::ListConstruct(%60, %60)
  %229 : int[] = prim::ListConstruct(%66, %66)
  %230 : int[] = prim::ListConstruct(%60, %60)
  %input0.13 : Tensor = aten::conv2d(%out1.4, %weight.24, %bias.24, %228, %229, %230, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.15 : bool = prim::GetAttr[name="training"](%_1.10)
   = prim::If(%training.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.9 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.10)
      %234 : Tensor = aten::add_(%num_batches_tracked.9, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.17 : bool = prim::GetAttr[name="training"](%_1.10)
  %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%_1.10)
  %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%_1.10)
  %weight.26 : Tensor = prim::GetAttr[name="weight"](%_1.10)
  %bias.26 : Tensor = prim::GetAttr[name="bias"](%_1.10)
   = prim::If(%training.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %240 : int[] = aten::size(%input0.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.9 : int = aten::__getitem__(%240, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %242 : int = aten::len(%240) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %243 : int = aten::sub(%242, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.19 : int = prim::Loop(%243, %68, %size_prods.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.9 : int, %size_prods0.21 : int):
          %247 : int = aten::add(%i.9, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %248 : int = aten::__getitem__(%240, %247) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.9 : int = aten::mul(%size_prods0.21, %248) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.9)
      %250 : bool = aten::eq(%size_prods0.19, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%250) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %251 : str = aten::format(%65, %240) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%251, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.4 : Tensor = aten::batch_norm(%input0.13, %weight.26, %bias.26, %running_mean.9, %running_var.9, %training.17, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.4 : bool = prim::GetAttr[name="use_residual"](%_1.2)
  %input1.12 : Tensor = prim::If(%use_residual.4) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.4 : Tensor = aten::add(%out2.4, %input0.3, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.4)
    block1():
      -> (%out2.4)
  %expand_conv.6 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="expand_conv"](%_2)
  %depthwise_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_1.Sequential = prim::GetAttr[name="depthwise_conv"](%_2)
  %_0.12 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.6)
  %_1.12 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.6)
  %weight.28 : Tensor = prim::GetAttr[name="weight"](%_0.12)
  %bias.28 : Tensor? = prim::GetAttr[name="bias"](%_0.12)
  %262 : int[] = prim::ListConstruct(%60, %60)
  %263 : int[] = prim::ListConstruct(%60, %60)
  %264 : int[] = prim::ListConstruct(%60, %60)
  %input0.15 : Tensor = aten::conv2d(%input1.12, %weight.28, %bias.28, %262, %263, %264, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.19 : bool = prim::GetAttr[name="training"](%_1.12)
   = prim::If(%training.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.11 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.12)
      %268 : Tensor = aten::add_(%num_batches_tracked.11, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.21 : bool = prim::GetAttr[name="training"](%_1.12)
  %running_mean.11 : Tensor = prim::GetAttr[name="running_mean"](%_1.12)
  %running_var.11 : Tensor = prim::GetAttr[name="running_var"](%_1.12)
  %weight.30 : Tensor = prim::GetAttr[name="weight"](%_1.12)
  %bias.30 : Tensor = prim::GetAttr[name="bias"](%_1.12)
   = prim::If(%training.21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %274 : int[] = aten::size(%input0.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.11 : int = aten::__getitem__(%274, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %276 : int = aten::len(%274) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %277 : int = aten::sub(%276, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.23 : int = prim::Loop(%277, %68, %size_prods.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.11 : int, %size_prods0.25 : int):
          %281 : int = aten::add(%i.11, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %282 : int = aten::__getitem__(%274, %281) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.11 : int = aten::mul(%size_prods0.25, %282) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.11)
      %284 : bool = aten::eq(%size_prods0.23, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%284) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %285 : str = aten::format(%65, %274) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%285, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.10 : Tensor = aten::batch_norm(%input0.15, %weight.30, %bias.30, %running_mean.11, %running_var.11, %training.21, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.6 : Tensor = aten::gelu(%input1.10, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %se.6 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_2)
  %289 : int[] = prim::ListConstruct(%67, %70)
  %y.6 : Tensor = aten::mean(%out0.6, %289, %68, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.6 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc1"](%se.6)
  %weight.32 : Tensor = prim::GetAttr[name="weight"](%fc1.6)
  %bias.32 : Tensor? = prim::GetAttr[name="bias"](%fc1.6)
  %294 : int[] = prim::ListConstruct(%60, %60)
  %295 : int[] = prim::ListConstruct(%66, %66)
  %296 : int[] = prim::ListConstruct(%60, %60)
  %y0.6 : Tensor = aten::conv2d(%y.6, %weight.32, %bias.32, %294, %295, %296, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act1.6 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.6)
  %y1.6 : Tensor = aten::gelu(%y0.6, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %fc2.6 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc2"](%se.6)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%fc2.6)
  %bias.34 : Tensor? = prim::GetAttr[name="bias"](%fc2.6)
  %303 : int[] = prim::ListConstruct(%60, %60)
  %304 : int[] = prim::ListConstruct(%66, %66)
  %305 : int[] = prim::ListConstruct(%60, %60)
  %y2.6 : Tensor = aten::conv2d(%y1.6, %weight.34, %bias.34, %303, %304, %305, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act2.6 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.6)
  %y3.6 : Tensor = aten::sigmoid(%y2.6) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:327:15
  %out1.6 : Tensor = aten::mul(%out0.6, %y3.6) # /home/auto_update_valid_train.py:42:15
  %project_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_3.Sequential = prim::GetAttr[name="project_conv"](%_2)
  %_0.14 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="0"](%project_conv.6)
  %_1.14 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.6)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%_0.14)
  %bias.36 : Tensor? = prim::GetAttr[name="bias"](%_0.14)
  %315 : int[] = prim::ListConstruct(%60, %60)
  %316 : int[] = prim::ListConstruct(%66, %66)
  %317 : int[] = prim::ListConstruct(%60, %60)
  %input0.17 : Tensor = aten::conv2d(%out1.6, %weight.36, %bias.36, %315, %316, %317, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.23 : bool = prim::GetAttr[name="training"](%_1.14)
   = prim::If(%training.23) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.13 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.14)
      %321 : Tensor = aten::add_(%num_batches_tracked.13, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.25 : bool = prim::GetAttr[name="training"](%_1.14)
  %running_mean.13 : Tensor = prim::GetAttr[name="running_mean"](%_1.14)
  %running_var.13 : Tensor = prim::GetAttr[name="running_var"](%_1.14)
  %weight.38 : Tensor = prim::GetAttr[name="weight"](%_1.14)
  %bias.38 : Tensor = prim::GetAttr[name="bias"](%_1.14)
   = prim::If(%training.25) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %327 : int[] = aten::size(%input0.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.13 : int = aten::__getitem__(%327, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %329 : int = aten::len(%327) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %330 : int = aten::sub(%329, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.27 : int = prim::Loop(%330, %68, %size_prods.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.13 : int, %size_prods0.29 : int):
          %334 : int = aten::add(%i.13, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %335 : int = aten::__getitem__(%327, %334) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.13 : int = aten::mul(%size_prods0.29, %335) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.13)
      %337 : bool = aten::eq(%size_prods0.27, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%337) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %338 : str = aten::format(%65, %327) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%338, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.6 : Tensor = aten::batch_norm(%input0.17, %weight.38, %bias.38, %running_mean.13, %running_var.13, %training.25, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.6 : bool = prim::GetAttr[name="use_residual"](%_2)
  %input2.1 : Tensor = prim::If(%use_residual.6) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.6 : Tensor = aten::add(%out2.6, %input1.12, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.6)
    block1():
      -> (%out2.6)
  %expand_conv.8 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="expand_conv"](%_3)
  %depthwise_conv.8 : __torch__.torch.nn.modules.container.___torch_mangle_1.Sequential = prim::GetAttr[name="depthwise_conv"](%_3)
  %_0.16 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.8)
  %_1.16 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.8)
  %weight.40 : Tensor = prim::GetAttr[name="weight"](%_0.16)
  %bias.40 : Tensor? = prim::GetAttr[name="bias"](%_0.16)
  %349 : int[] = prim::ListConstruct(%60, %60)
  %350 : int[] = prim::ListConstruct(%60, %60)
  %351 : int[] = prim::ListConstruct(%60, %60)
  %input0.19 : Tensor = aten::conv2d(%input2.1, %weight.40, %bias.40, %349, %350, %351, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.27 : bool = prim::GetAttr[name="training"](%_1.16)
   = prim::If(%training.27) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.15 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.16)
      %355 : Tensor = aten::add_(%num_batches_tracked.15, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.29 : bool = prim::GetAttr[name="training"](%_1.16)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%_1.16)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%_1.16)
  %weight.42 : Tensor = prim::GetAttr[name="weight"](%_1.16)
  %bias.42 : Tensor = prim::GetAttr[name="bias"](%_1.16)
   = prim::If(%training.29) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %361 : int[] = aten::size(%input0.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.15 : int = aten::__getitem__(%361, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %363 : int = aten::len(%361) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %364 : int = aten::sub(%363, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.31 : int = prim::Loop(%364, %68, %size_prods.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.15 : int, %size_prods0.33 : int):
          %368 : int = aten::add(%i.15, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %369 : int = aten::__getitem__(%361, %368) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.15 : int = aten::mul(%size_prods0.33, %369) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.15)
      %371 : bool = aten::eq(%size_prods0.31, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%371) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %372 : str = aten::format(%65, %361) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%372, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.14 : Tensor = aten::batch_norm(%input0.19, %weight.42, %bias.42, %running_mean.15, %running_var.15, %training.29, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.8 : Tensor = aten::gelu(%input1.14, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %se.8 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_3)
  %376 : int[] = prim::ListConstruct(%67, %70)
  %y.8 : Tensor = aten::mean(%out0.8, %376, %68, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.8 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc1"](%se.8)
  %weight.44 : Tensor = prim::GetAttr[name="weight"](%fc1.8)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%fc1.8)
  %381 : int[] = prim::ListConstruct(%60, %60)
  %382 : int[] = prim::ListConstruct(%66, %66)
  %383 : int[] = prim::ListConstruct(%60, %60)
  %y0.8 : Tensor = aten::conv2d(%y.8, %weight.44, %bias.44, %381, %382, %383, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act1.8 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.8)
  %y1.8 : Tensor = aten::gelu(%y0.8, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %fc2.8 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="fc2"](%se.8)
  %weight.46 : Tensor = prim::GetAttr[name="weight"](%fc2.8)
  %bias.46 : Tensor? = prim::GetAttr[name="bias"](%fc2.8)
  %390 : int[] = prim::ListConstruct(%60, %60)
  %391 : int[] = prim::ListConstruct(%66, %66)
  %392 : int[] = prim::ListConstruct(%60, %60)
  %y2.8 : Tensor = aten::conv2d(%y1.8, %weight.46, %bias.46, %390, %391, %392, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %act2.8 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.8)
  %y3.8 : Tensor = aten::sigmoid(%y2.8) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:327:15
  %out1.8 : Tensor = aten::mul(%out0.8, %y3.8) # /home/auto_update_valid_train.py:42:15
  %project_conv.8 : __torch__.torch.nn.modules.container.___torch_mangle_3.Sequential = prim::GetAttr[name="project_conv"](%_3)
  %_0.18 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="0"](%project_conv.8)
  %_1.18 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.8)
  %weight.48 : Tensor = prim::GetAttr[name="weight"](%_0.18)
  %bias.48 : Tensor? = prim::GetAttr[name="bias"](%_0.18)
  %402 : int[] = prim::ListConstruct(%60, %60)
  %403 : int[] = prim::ListConstruct(%66, %66)
  %404 : int[] = prim::ListConstruct(%60, %60)
  %input0.21 : Tensor = aten::conv2d(%out1.8, %weight.48, %bias.48, %402, %403, %404, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.31 : bool = prim::GetAttr[name="training"](%_1.18)
   = prim::If(%training.31) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.17 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.18)
      %408 : Tensor = aten::add_(%num_batches_tracked.17, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.33 : bool = prim::GetAttr[name="training"](%_1.18)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%_1.18)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%_1.18)
  %weight.50 : Tensor = prim::GetAttr[name="weight"](%_1.18)
  %bias.50 : Tensor = prim::GetAttr[name="bias"](%_1.18)
   = prim::If(%training.33) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %414 : int[] = aten::size(%input0.21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.17 : int = aten::__getitem__(%414, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %416 : int = aten::len(%414) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %417 : int = aten::sub(%416, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.35 : int = prim::Loop(%417, %68, %size_prods.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.17 : int, %size_prods0.37 : int):
          %421 : int = aten::add(%i.17, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %422 : int = aten::__getitem__(%414, %421) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.17 : int = aten::mul(%size_prods0.37, %422) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.17)
      %424 : bool = aten::eq(%size_prods0.35, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%424) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %425 : str = aten::format(%65, %414) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%425, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.8 : Tensor = aten::batch_norm(%input0.21, %weight.50, %bias.50, %running_mean.17, %running_var.17, %training.33, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.8 : bool = prim::GetAttr[name="use_residual"](%_3)
  %input3.1 : Tensor = prim::If(%use_residual.8) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.8 : Tensor = aten::add(%out2.8, %input2.1, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.8)
    block1():
      -> (%out2.8)
  %expand_conv.10 : __torch__.torch.nn.modules.container.___torch_mangle_6.Sequential = prim::GetAttr[name="expand_conv"](%_4)
  %_0.20 : __torch__.torch.nn.modules.conv.___torch_mangle_4.Conv2d = prim::GetAttr[name="0"](%expand_conv.10)
  %_1.20 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_5.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.10)
  %weight.52 : Tensor = prim::GetAttr[name="weight"](%_0.20)
  %bias.52 : Tensor? = prim::GetAttr[name="bias"](%_0.20)
  %435 : int[] = prim::ListConstruct(%60, %60)
  %436 : int[] = prim::ListConstruct(%66, %66)
  %437 : int[] = prim::ListConstruct(%60, %60)
  %input0.23 : Tensor = aten::conv2d(%input3.1, %weight.52, %bias.52, %435, %436, %437, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.35 : bool = prim::GetAttr[name="training"](%_1.20)
   = prim::If(%training.35) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.19 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.20)
      %441 : Tensor = aten::add_(%num_batches_tracked.19, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.37 : bool = prim::GetAttr[name="training"](%_1.20)
  %running_mean.19 : Tensor = prim::GetAttr[name="running_mean"](%_1.20)
  %running_var.19 : Tensor = prim::GetAttr[name="running_var"](%_1.20)
  %weight.54 : Tensor = prim::GetAttr[name="weight"](%_1.20)
  %bias.54 : Tensor = prim::GetAttr[name="bias"](%_1.20)
   = prim::If(%training.37) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %447 : int[] = aten::size(%input0.23) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.19 : int = aten::__getitem__(%447, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %449 : int = aten::len(%447) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %450 : int = aten::sub(%449, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.39 : int = prim::Loop(%450, %68, %size_prods.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.19 : int, %size_prods0.41 : int):
          %454 : int = aten::add(%i.19, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %455 : int = aten::__getitem__(%447, %454) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.19 : int = aten::mul(%size_prods0.41, %455) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%68, %size_prods1.19)
      %457 : bool = aten::eq(%size_prods0.39, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%457) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %458 : str = aten::format(%65, %447) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%458, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.16 : Tensor = aten::batch_norm(%input0.23, %weight.54, %bias.54, %running_mean.19, %running_var.19, %training.37, %62, %63, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out.2 : Tensor = aten::gelu(%input1.16, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.10 : __torch__.torch.nn.modules.container.___torch_mangle_8.Sequential = prim::GetAttr[name="depthwise_conv"](%_4)
  %_0.22 : __torch__.torch.nn.modules.conv.___torch_mangle_7.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.10)
  %_1.22 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_5.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.10)
  %weight.56 : Tensor = prim::GetAttr[name="weight"](%_0.22)
  %bias.56 : Tensor? = prim::GetAttr[name="bias"](%_0.22)
  %466 : int[] = prim::ListConstruct(%67, %67)
  %467 : int[] = prim::ListConstruct(%67, %67)
  %468 : int[] = prim::ListConstruct(%60, %60)
  %input0.25 : Tensor = aten::conv2d(%out.2, %weight.56, %bias.56, %466, %467, %468, %59) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.39 : bool = prim::GetAttr[name="training"](%_1.22)
   = prim::If(%training.39) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.21 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.22)
      %472 : Tensor = aten::add_(%num_batches_tracked.21, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.41 : bool = prim::GetAttr[name="training"](%_1.22)
  %running_mean.21 : Tensor = prim::GetAttr[name="running_mean"](%_1.22)
