graph(%self.1 : __torch__.utils_general_v2.___torch_mangle_6860.MobileNetECA,
      %x.1 : Tensor):
  %2 : NoneType = prim::Constant()
  %3 : bool = prim::Constant[value=0]()
  %4 : int = prim::Constant[value=2]() # /root/NASChainC100/utils_general_v2.py:272:8
  %5 : int = prim::Constant[value=3]() # /root/NASChainC100/utils_general_v2.py:272:8
  %stem.1 : __torch__.torch.nn.modules.container.___torch_mangle_408.Sequential = prim::GetAttr[name="stem"](%self.1)
  %29 : float = prim::Constant[value=1.0000000000000001e-05]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:204:12
  %30 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %31 : int = prim::Constant[value=2]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:31
  %32 : int = prim::Constant[value=0]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:22
  %33 : int = prim::Constant[value=1]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:33
  %34 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
  %35 : str = prim::Constant[value="builtins.ValueError"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:452:18
  %bn_training.2 : bool = prim::Constant[value=1]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:184:26
  %37 : str = prim::Constant[value="none"]()
  %_0.5 : __torch__.torch.nn.modules.conv.___torch_mangle_406.Conv2d = prim::GetAttr[name="0"](%stem.1)
  %_1.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_407.BatchNorm2d = prim::GetAttr[name="1"](%stem.1)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %bias.36 : Tensor? = prim::GetAttr[name="bias"](%_0.5)
  %42 : int[] = prim::ListConstruct(%33, %33)
  %43 : int[] = prim::ListConstruct(%33, %33)
  %44 : int[] = prim::ListConstruct(%33, %33)
  %input0.3 : Tensor = aten::conv2d(%x.1, %weight.36, %bias.36, %42, %43, %44, %33) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
  %training.10 : bool = prim::GetAttr[name="training"](%_1.5)
   = prim::If(%training.10) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.6 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.5)
      %48 : Tensor = aten::add_(%num_batches_tracked.6, %33, %33) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.12 : bool = prim::GetAttr[name="training"](%_1.5)
  %running_mean.6 : Tensor = prim::GetAttr[name="running_mean"](%_1.5)
  %running_var.6 : Tensor = prim::GetAttr[name="running_var"](%_1.5)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%_1.5)
  %bias.34 : Tensor = prim::GetAttr[name="bias"](%_1.5)
   = prim::If(%training.12) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
    block0():
      %54 : int[] = aten::size(%input0.3) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
      %size_prods.6 : int = aten::__getitem__(%54, %32) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
      %56 : int = aten::len(%54) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
      %57 : int = aten::sub(%56, %31) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.3 : int = prim::Loop(%57, %bn_training.2, %size_prods.6) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
        block0(%i.6 : int, %size_prods0.14 : int):
          %61 : int = aten::add(%i.6, %31) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
          %62 : int = aten::__getitem__(%54, %61) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.6 : int = aten::mul(%size_prods0.14, %62) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
          -> (%bn_training.2, %size_prods1.6)
      %64 : bool = aten::eq(%size_prods0.3, %33) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%64) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
        block0():
          %65 : str = aten::format(%34, %54) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%65, %35) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.3 : Tensor = aten::batch_norm(%input0.3, %weight.34, %bias.34, %running_mean.6, %running_var.6, %training.12, %30, %29, %bn_training.2) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
  %x0.1 : Tensor = aten::gelu(%input1.3, %37) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
  %layers.1 : __torch__.torch.nn.modules.container.___torch_mangle_6857.ModuleList = prim::GetAttr[name="layers"](%self.1)
  %_0.3 : __torch__.utils_general_v2.___torch_mangle_6852.InvertedResidual = prim::GetAttr[name="0"](%layers.1)
  %_1.3 : __torch__.utils_general_v2.___torch_mangle_422.InvertedResidual = prim::GetAttr[name="1"](%layers.1)
  %_2 : __torch__.utils_general_v2.___torch_mangle_6854.InvertedResidual = prim::GetAttr[name="2"](%layers.1)
  %_3.2 : __torch__.utils_general_v2.___torch_mangle_2151.InvertedResidual = prim::GetAttr[name="3"](%layers.1)
  %_4.2 : __torch__.utils_general_v2.___torch_mangle_6856.InvertedResidual = prim::GetAttr[name="4"](%layers.1)
  %_5 : __torch__.utils_general_v2.___torch_mangle_1796.InvertedResidual = prim::GetAttr[name="5"](%layers.1)
  %_6.2 : __torch__.utils_general_v2.___torch_mangle_1975.InvertedResidual = prim::GetAttr[name="6"](%layers.1)
  %68 : int = prim::Constant[value=0]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:46
  %69 : bool = prim::Constant[value=1]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
  %70 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
  %71 : int = prim::Constant[value=2]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:31
  %72 : str = prim::Constant[value="builtins.ValueError"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:452:18
  %73 : float = prim::Constant[value=1.0000000000000001e-05]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:204:12
  %74 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %75 : str = prim::Constant[value="none"]()
  %76 : int = prim::Constant[value=60]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:75
  %77 : int = prim::Constant[value=3]() # /root/NASChainC100/utils_general_v2.py:171:22
  %78 : NoneType = prim::Constant()
  %79 : int = prim::Constant[value=1]()
  %use_res_connect.2 : bool = prim::GetAttr[name="use_res_connect"](%_0.3)
  %x1.1 : Tensor = prim::If(%use_res_connect.2) # /root/NASChainC100/utils_general_v2.py:222:8
    block0():
      %conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_6851.Sequential = prim::GetAttr[name="conv"](%_0.3)
      %_0.7 : __torch__.torch.nn.modules.conv.___torch_mangle_6844.Conv2d = prim::GetAttr[name="0"](%conv.2)
      %_1.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6845.BatchNorm2d = prim::GetAttr[name="1"](%conv.2)
      %_3.4 : __torch__.torch.nn.modules.conv.___torch_mangle_6846.Conv2d = prim::GetAttr[name="3"](%conv.2)
      %_4.4 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6845.BatchNorm2d = prim::GetAttr[name="4"](%conv.2)
      %_6.4 : __torch__.utils_general_v2.___torch_mangle_6849.ECABlock = prim::GetAttr[name="6"](%conv.2)
      %_7.2 : __torch__.torch.nn.modules.conv.___torch_mangle_6850.Conv2d = prim::GetAttr[name="7"](%conv.2)
      %_8.2 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6.BatchNorm2d = prim::GetAttr[name="8"](%conv.2)
      %weight.18 : Tensor = prim::GetAttr[name="weight"](%_0.7)
      %bias.18 : Tensor? = prim::GetAttr[name="bias"](%_0.7)
      %92 : int[] = prim::ListConstruct(%79, %79)
      %93 : int[] = prim::ListConstruct(%68, %68)
      %94 : int[] = prim::ListConstruct(%79, %79)
      %input0.7 : Tensor = aten::conv2d(%x0.1, %weight.18, %bias.18, %92, %93, %94, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.28 : bool = prim::GetAttr[name="training"](%_1.7)
       = prim::If(%training.28) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.14 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.7)
          %98 : Tensor = aten::add_(%num_batches_tracked.14, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.16 : bool = prim::GetAttr[name="training"](%_1.7)
      %running_mean.14 : Tensor = prim::GetAttr[name="running_mean"](%_1.7)
      %running_var.14 : Tensor = prim::GetAttr[name="running_var"](%_1.7)
      %weight.20 : Tensor = prim::GetAttr[name="weight"](%_1.7)
      %bias.20 : Tensor = prim::GetAttr[name="bias"](%_1.7)
       = prim::If(%training.16) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %104 : int[] = aten::size(%input0.7) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.10 : int = aten::__getitem__(%104, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %106 : int = aten::len(%104) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %107 : int = aten::sub(%106, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.20 : int = prim::Loop(%107, %69, %size_prods.10) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.10 : int, %size_prods0.22 : int):
              %111 : int = aten::add(%i.10, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %112 : int = aten::__getitem__(%104, %111) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.10 : int = aten::mul(%size_prods0.22, %112) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.10)
          %114 : bool = aten::eq(%size_prods0.20, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%114) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %115 : str = aten::format(%70, %104) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%115, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input1.7 : Tensor = aten::batch_norm(%input0.7, %weight.20, %bias.20, %running_mean.14, %running_var.14, %training.16, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input2.5 : Tensor = aten::gelu(%input1.7, %75) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %weight.22 : Tensor = prim::GetAttr[name="weight"](%_3.4)
      %bias.22 : Tensor? = prim::GetAttr[name="bias"](%_3.4)
      %120 : int[] = prim::ListConstruct(%79, %79)
      %121 : int[] = prim::ListConstruct(%79, %79)
      %122 : int[] = prim::ListConstruct(%79, %79)
      %input3.5 : Tensor = aten::conv2d(%input2.5, %weight.22, %bias.22, %120, %121, %122, %76) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.18 : bool = prim::GetAttr[name="training"](%_4.4)
       = prim::If(%training.18) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.10 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.4)
          %126 : Tensor = aten::add_(%num_batches_tracked.10, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.20 : bool = prim::GetAttr[name="training"](%_4.4)
      %running_mean.10 : Tensor = prim::GetAttr[name="running_mean"](%_4.4)
      %running_var.10 : Tensor = prim::GetAttr[name="running_var"](%_4.4)
      %weight.24 : Tensor = prim::GetAttr[name="weight"](%_4.4)
      %bias.24 : Tensor = prim::GetAttr[name="bias"](%_4.4)
       = prim::If(%training.20) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %132 : int[] = aten::size(%input3.5) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.12 : int = aten::__getitem__(%132, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %134 : int = aten::len(%132) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %135 : int = aten::sub(%134, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.24 : int = prim::Loop(%135, %69, %size_prods.12) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.12 : int, %size_prods0.26 : int):
              %139 : int = aten::add(%i.12, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %140 : int = aten::__getitem__(%132, %139) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.12 : int = aten::mul(%size_prods0.26, %140) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.12)
          %142 : bool = aten::eq(%size_prods0.24, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%142) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %143 : str = aten::format(%70, %132) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%143, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input4.5 : Tensor = aten::batch_norm(%input3.5, %weight.24, %bias.24, %running_mean.10, %running_var.10, %training.20, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input5.5 : Tensor = aten::gelu(%input4.5, %75) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %146 : int[] = prim::ListConstruct(%71, %77)
      %y.5 : Tensor = aten::mean(%input5.5, %146, %69, %78) # /root/NASChainC100/utils_general_v2.py:171:12
      %conv1.5 : __torch__.torch.nn.modules.conv.___torch_mangle_6847.Conv2d = prim::GetAttr[name="conv1"](%_6.4)
      %weight.26 : Tensor = prim::GetAttr[name="weight"](%conv1.5)
      %bias.26 : Tensor? = prim::GetAttr[name="bias"](%conv1.5)
      %151 : int[] = prim::ListConstruct(%79, %79)
      %152 : int[] = prim::ListConstruct(%68, %68)
      %153 : int[] = prim::ListConstruct(%79, %79)
      %y0.5 : Tensor = aten::conv2d(%y.5, %weight.26, %bias.26, %151, %152, %153, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out.5 : Tensor = aten::sigmoid(%y0.5) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %y_out0.5 : Tensor = aten::mul(%y_out.5, %y0.5) # /root/NASChainC100/utils_general_v2.py:174:16
      %conv2.5 : __torch__.torch.nn.modules.conv.___torch_mangle_6848.Conv2d = prim::GetAttr[name="conv2"](%_6.4)
      %weight.28 : Tensor = prim::GetAttr[name="weight"](%conv2.5)
      %bias.28 : Tensor? = prim::GetAttr[name="bias"](%conv2.5)
      %160 : int[] = prim::ListConstruct(%79, %79)
      %161 : int[] = prim::ListConstruct(%68, %68)
      %162 : int[] = prim::ListConstruct(%79, %79)
      %y_out1.5 : Tensor = aten::conv2d(%y_out0.5, %weight.28, %bias.28, %160, %161, %162, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out2.5 : Tensor = aten::sigmoid(%y_out1.5) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %input6.5 : Tensor = aten::mul(%input5.5, %y_out2.5) # /root/NASChainC100/utils_general_v2.py:177:15
      %weight.30 : Tensor = prim::GetAttr[name="weight"](%_7.2)
      %bias.30 : Tensor? = prim::GetAttr[name="bias"](%_7.2)
      %168 : int[] = prim::ListConstruct(%79, %79)
      %169 : int[] = prim::ListConstruct(%68, %68)
      %170 : int[] = prim::ListConstruct(%79, %79)
      %input7.5 : Tensor = aten::conv2d(%input6.5, %weight.30, %bias.30, %168, %169, %170, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.22 : bool = prim::GetAttr[name="training"](%_8.2)
       = prim::If(%training.22) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.12 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_8.2)
          %174 : Tensor = aten::add_(%num_batches_tracked.12, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.24 : bool = prim::GetAttr[name="training"](%_8.2)
      %running_mean.12 : Tensor = prim::GetAttr[name="running_mean"](%_8.2)
      %running_var.12 : Tensor = prim::GetAttr[name="running_var"](%_8.2)
      %weight.32 : Tensor = prim::GetAttr[name="weight"](%_8.2)
      %bias.32 : Tensor = prim::GetAttr[name="bias"](%_8.2)
       = prim::If(%training.24) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %180 : int[] = aten::size(%input7.5) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.14 : int = aten::__getitem__(%180, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %182 : int = aten::len(%180) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %183 : int = aten::sub(%182, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.28 : int = prim::Loop(%183, %69, %size_prods.14) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.14 : int, %size_prods0.30 : int):
              %187 : int = aten::add(%i.14, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %188 : int = aten::__getitem__(%180, %187) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.14 : int = aten::mul(%size_prods0.30, %188) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.14)
          %190 : bool = aten::eq(%size_prods0.28, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%190) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %191 : str = aten::format(%70, %180) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%191, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %192 : Tensor = aten::batch_norm(%input7.5, %weight.32, %bias.32, %running_mean.12, %running_var.12, %training.24, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %193 : Tensor = aten::add(%x0.1, %192, %79) # /root/NASChainC100/utils_general_v2.py:223:19
      -> (%193)
    block1():
      %conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_6851.Sequential = prim::GetAttr[name="conv"](%_0.3)
      %_0.9 : __torch__.torch.nn.modules.conv.___torch_mangle_6844.Conv2d = prim::GetAttr[name="0"](%conv.4)
      %_1.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6845.BatchNorm2d = prim::GetAttr[name="1"](%conv.4)
      %_3.6 : __torch__.torch.nn.modules.conv.___torch_mangle_6846.Conv2d = prim::GetAttr[name="3"](%conv.4)
      %_4.6 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6845.BatchNorm2d = prim::GetAttr[name="4"](%conv.4)
      %_6.6 : __torch__.utils_general_v2.___torch_mangle_6849.ECABlock = prim::GetAttr[name="6"](%conv.4)
      %_7.4 : __torch__.torch.nn.modules.conv.___torch_mangle_6850.Conv2d = prim::GetAttr[name="7"](%conv.4)
      %_8.4 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_6.BatchNorm2d = prim::GetAttr[name="8"](%conv.4)
      %weight.58 : Tensor = prim::GetAttr[name="weight"](%_0.9)
      %bias.58 : Tensor? = prim::GetAttr[name="bias"](%_0.9)
      %204 : int[] = prim::ListConstruct(%79, %79)
      %205 : int[] = prim::ListConstruct(%68, %68)
      %206 : int[] = prim::ListConstruct(%79, %79)
      %input0.5 : Tensor = aten::conv2d(%x0.1, %weight.58, %bias.58, %204, %205, %206, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.40 : bool = prim::GetAttr[name="training"](%_1.9)
       = prim::If(%training.40) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.20 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.9)
          %210 : Tensor = aten::add_(%num_batches_tracked.20, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.42 : bool = prim::GetAttr[name="training"](%_1.9)
      %running_mean.20 : Tensor = prim::GetAttr[name="running_mean"](%_1.9)
      %running_var.20 : Tensor = prim::GetAttr[name="running_var"](%_1.9)
      %weight.54 : Tensor = prim::GetAttr[name="weight"](%_1.9)
      %bias.54 : Tensor = prim::GetAttr[name="bias"](%_1.9)
       = prim::If(%training.42) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %216 : int[] = aten::size(%input0.5) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.16 : int = aten::__getitem__(%216, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %218 : int = aten::len(%216) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %219 : int = aten::sub(%218, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.32 : int = prim::Loop(%219, %69, %size_prods.16) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.16 : int, %size_prods0.34 : int):
              %223 : int = aten::add(%i.16, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %224 : int = aten::__getitem__(%216, %223) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.16 : int = aten::mul(%size_prods0.34, %224) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.16)
          %226 : bool = aten::eq(%size_prods0.32, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%226) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %227 : str = aten::format(%70, %216) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%227, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input1.5 : Tensor = aten::batch_norm(%input0.5, %weight.54, %bias.54, %running_mean.20, %running_var.20, %training.42, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input2.3 : Tensor = aten::gelu(%input1.5, %75) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %weight.56 : Tensor = prim::GetAttr[name="weight"](%_3.6)
      %bias.56 : Tensor? = prim::GetAttr[name="bias"](%_3.6)
      %232 : int[] = prim::ListConstruct(%79, %79)
      %233 : int[] = prim::ListConstruct(%79, %79)
      %234 : int[] = prim::ListConstruct(%79, %79)
      %input3.3 : Tensor = aten::conv2d(%input2.3, %weight.56, %bias.56, %232, %233, %234, %76) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.44 : bool = prim::GetAttr[name="training"](%_4.6)
       = prim::If(%training.44) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.22 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.6)
          %238 : Tensor = aten::add_(%num_batches_tracked.22, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.46 : bool = prim::GetAttr[name="training"](%_4.6)
      %running_mean.22 : Tensor = prim::GetAttr[name="running_mean"](%_4.6)
      %running_var.22 : Tensor = prim::GetAttr[name="running_var"](%_4.6)
      %weight.60 : Tensor = prim::GetAttr[name="weight"](%_4.6)
      %bias.60 : Tensor = prim::GetAttr[name="bias"](%_4.6)
       = prim::If(%training.46) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %244 : int[] = aten::size(%input3.3) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.18 : int = aten::__getitem__(%244, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %246 : int = aten::len(%244) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %247 : int = aten::sub(%246, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.36 : int = prim::Loop(%247, %69, %size_prods.18) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.18 : int, %size_prods0.38 : int):
              %251 : int = aten::add(%i.18, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %252 : int = aten::__getitem__(%244, %251) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.18 : int = aten::mul(%size_prods0.38, %252) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.18)
          %254 : bool = aten::eq(%size_prods0.36, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%254) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %255 : str = aten::format(%70, %244) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%255, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input4.3 : Tensor = aten::batch_norm(%input3.3, %weight.60, %bias.60, %running_mean.22, %running_var.22, %training.46, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input5.3 : Tensor = aten::gelu(%input4.3, %75) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %258 : int[] = prim::ListConstruct(%71, %77)
      %y.3 : Tensor = aten::mean(%input5.3, %258, %69, %78) # /root/NASChainC100/utils_general_v2.py:171:12
      %conv1.3 : __torch__.torch.nn.modules.conv.___torch_mangle_6847.Conv2d = prim::GetAttr[name="conv1"](%_6.6)
      %weight.52 : Tensor = prim::GetAttr[name="weight"](%conv1.3)
      %bias.52 : Tensor? = prim::GetAttr[name="bias"](%conv1.3)
      %263 : int[] = prim::ListConstruct(%79, %79)
      %264 : int[] = prim::ListConstruct(%68, %68)
      %265 : int[] = prim::ListConstruct(%79, %79)
      %y0.3 : Tensor = aten::conv2d(%y.3, %weight.52, %bias.52, %263, %264, %265, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out.3 : Tensor = aten::sigmoid(%y0.3) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %y_out0.3 : Tensor = aten::mul(%y_out.3, %y0.3) # /root/NASChainC100/utils_general_v2.py:174:16
      %conv2.3 : __torch__.torch.nn.modules.conv.___torch_mangle_6848.Conv2d = prim::GetAttr[name="conv2"](%_6.6)
      %weight.64 : Tensor = prim::GetAttr[name="weight"](%conv2.3)
      %bias.64 : Tensor? = prim::GetAttr[name="bias"](%conv2.3)
      %272 : int[] = prim::ListConstruct(%79, %79)
      %273 : int[] = prim::ListConstruct(%68, %68)
      %274 : int[] = prim::ListConstruct(%79, %79)
      %y_out1.3 : Tensor = aten::conv2d(%y_out0.3, %weight.64, %bias.64, %272, %273, %274, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out2.3 : Tensor = aten::sigmoid(%y_out1.3) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %input6.3 : Tensor = aten::mul(%input5.3, %y_out2.3) # /root/NASChainC100/utils_general_v2.py:177:15
      %weight.14 : Tensor = prim::GetAttr[name="weight"](%_7.4)
      %bias.14 : Tensor? = prim::GetAttr[name="bias"](%_7.4)
      %280 : int[] = prim::ListConstruct(%79, %79)
      %281 : int[] = prim::ListConstruct(%68, %68)
      %282 : int[] = prim::ListConstruct(%79, %79)
      %input7.3 : Tensor = aten::conv2d(%input6.3, %weight.14, %bias.14, %280, %281, %282, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.14 : bool = prim::GetAttr[name="training"](%_8.4)
       = prim::If(%training.14) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.8 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_8.4)
          %286 : Tensor = aten::add_(%num_batches_tracked.8, %79, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.26 : bool = prim::GetAttr[name="training"](%_8.4)
      %running_mean.8 : Tensor = prim::GetAttr[name="running_mean"](%_8.4)
      %running_var.8 : Tensor = prim::GetAttr[name="running_var"](%_8.4)
      %weight.16 : Tensor = prim::GetAttr[name="weight"](%_8.4)
      %bias.16 : Tensor = prim::GetAttr[name="bias"](%_8.4)
       = prim::If(%training.26) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %292 : int[] = aten::size(%input7.3) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.8 : int = aten::__getitem__(%292, %68) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %294 : int = aten::len(%292) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %295 : int = aten::sub(%294, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.16 : int = prim::Loop(%295, %69, %size_prods.8) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.8 : int, %size_prods0.18 : int):
              %299 : int = aten::add(%i.8, %71) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %300 : int = aten::__getitem__(%292, %299) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.8 : int = aten::mul(%size_prods0.18, %300) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%69, %size_prods1.8)
          %302 : bool = aten::eq(%size_prods0.16, %79) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%302) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %303 : str = aten::format(%70, %292) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%303, %72) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %304 : Tensor = aten::batch_norm(%input7.3, %weight.16, %bias.16, %running_mean.8, %running_var.8, %training.26, %74, %73, %69) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      -> (%304)
  %305 : int = prim::Constant[value=3]() # /root/NASChainC100/utils_general_v2.py:171:22
  %306 : int = prim::Constant[value=105]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:75
  %307 : float = prim::Constant[value=1.0000000000000001e-05]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:204:12
  %308 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %309 : int = prim::Constant[value=2]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:31
  %310 : int = prim::Constant[value=0]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:46
  %311 : int = prim::Constant[value=1]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:550:33
  %312 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
  %313 : str = prim::Constant[value="builtins.ValueError"]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:452:18
  %bn_training.4 : bool = prim::Constant[value=1]() # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:184:26
  %315 : str = prim::Constant[value="none"]()
  %316 : NoneType = prim::Constant()
  %use_res_connect.4 : bool = prim::GetAttr[name="use_res_connect"](%_1.3)
  %x2.1 : Tensor = prim::If(%use_res_connect.4) # /root/NASChainC100/utils_general_v2.py:222:8
    block0():
      %conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_421.Sequential = prim::GetAttr[name="conv"](%_1.3)
      %_0.11 : __torch__.torch.nn.modules.conv.___torch_mangle_8.Conv2d = prim::GetAttr[name="0"](%conv.6)
      %_1.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_9.BatchNorm2d = prim::GetAttr[name="1"](%conv.6)
      %_3.8 : __torch__.torch.nn.modules.conv.___torch_mangle_10.Conv2d = prim::GetAttr[name="3"](%conv.6)
      %_4.8 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_9.BatchNorm2d = prim::GetAttr[name="4"](%conv.6)
      %_6.8 : __torch__.utils_general_v2.___torch_mangle_420.ECABlock = prim::GetAttr[name="6"](%conv.6)
      %_7.6 : __torch__.torch.nn.modules.conv.___torch_mangle_11.Conv2d = prim::GetAttr[name="7"](%conv.6)
      %_8.6 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_14.BatchNorm2d = prim::GetAttr[name="8"](%conv.6)
      %weight.66 : Tensor = prim::GetAttr[name="weight"](%_0.11)
      %bias.66 : Tensor? = prim::GetAttr[name="bias"](%_0.11)
      %329 : int[] = prim::ListConstruct(%311, %311)
      %330 : int[] = prim::ListConstruct(%310, %310)
      %331 : int[] = prim::ListConstruct(%311, %311)
      %input.2 : Tensor = aten::conv2d(%x1.1, %weight.66, %bias.66, %329, %330, %331, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.48 : bool = prim::GetAttr[name="training"](%_1.11)
       = prim::If(%training.48) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.24 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.11)
          %335 : Tensor = aten::add_(%num_batches_tracked.24, %311, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.30 : bool = prim::GetAttr[name="training"](%_1.11)
      %running_mean.24 : Tensor = prim::GetAttr[name="running_mean"](%_1.11)
      %running_var.24 : Tensor = prim::GetAttr[name="running_var"](%_1.11)
      %weight.38 : Tensor = prim::GetAttr[name="weight"](%_1.11)
      %bias.38 : Tensor = prim::GetAttr[name="bias"](%_1.11)
       = prim::If(%training.30) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %341 : int[] = aten::size(%input.2) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods.20 : int = aten::__getitem__(%341, %310) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %343 : int = aten::len(%341) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %344 : int = aten::sub(%343, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods0.40 : int = prim::Loop(%344, %bn_training.4, %size_prods.20) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i.20 : int, %size_prods0.42 : int):
              %348 : int = aten::add(%i.20, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %349 : int = aten::__getitem__(%341, %348) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods1.20 : int = aten::mul(%size_prods0.42, %349) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%bn_training.4, %size_prods1.20)
          %351 : bool = aten::eq(%size_prods0.40, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%351) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %352 : str = aten::format(%312, %341) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%352, %313) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input0.9 : Tensor = aten::batch_norm(%input.2, %weight.38, %bias.38, %running_mean.24, %running_var.24, %training.30, %308, %307, %bn_training.4) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input1.9 : Tensor = aten::gelu(%input0.9, %315) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %weight.40 : Tensor = prim::GetAttr[name="weight"](%_3.8)
      %bias.40 : Tensor? = prim::GetAttr[name="bias"](%_3.8)
      %357 : int[] = prim::ListConstruct(%309, %309)
      %358 : int[] = prim::ListConstruct(%309, %309)
      %359 : int[] = prim::ListConstruct(%311, %311)
      %input2.7 : Tensor = aten::conv2d(%input1.9, %weight.40, %bias.40, %357, %358, %359, %306) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.32 : bool = prim::GetAttr[name="training"](%_4.8)
       = prim::If(%training.32) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.16 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_4.8)
          %363 : Tensor = aten::add_(%num_batches_tracked.16, %311, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.34 : bool = prim::GetAttr[name="training"](%_4.8)
      %running_mean.16 : Tensor = prim::GetAttr[name="running_mean"](%_4.8)
      %running_var.16 : Tensor = prim::GetAttr[name="running_var"](%_4.8)
      %weight.42 : Tensor = prim::GetAttr[name="weight"](%_4.8)
      %bias.42 : Tensor = prim::GetAttr[name="bias"](%_4.8)
       = prim::If(%training.34) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %369 : int[] = aten::size(%input2.7) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods2.2 : int = aten::__getitem__(%369, %310) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %371 : int = aten::len(%369) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %372 : int = aten::sub(%371, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods3.1 : int = prim::Loop(%372, %bn_training.4, %size_prods2.2) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i0.2 : int, %size_prods3.8 : int):
              %376 : int = aten::add(%i0.2, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %377 : int = aten::__getitem__(%369, %376) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods4.2 : int = aten::mul(%size_prods3.8, %377) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%bn_training.4, %size_prods4.2)
          %379 : bool = aten::eq(%size_prods3.1, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%379) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %380 : str = aten::format(%312, %369) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%380, %313) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input3.7 : Tensor = aten::batch_norm(%input2.7, %weight.42, %bias.42, %running_mean.16, %running_var.16, %training.34, %308, %307, %bn_training.4) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2812:11
      %input4.7 : Tensor = aten::gelu(%input3.7, %315) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:734:15
      %383 : int[] = prim::ListConstruct(%309, %305)
      %y.7 : Tensor = aten::mean(%input4.7, %383, %bn_training.4, %316) # /root/NASChainC100/utils_general_v2.py:171:12
      %conv1.7 : __torch__.torch.nn.modules.conv.___torch_mangle_418.Conv2d = prim::GetAttr[name="conv1"](%_6.8)
      %weight.44 : Tensor = prim::GetAttr[name="weight"](%conv1.7)
      %bias.44 : Tensor? = prim::GetAttr[name="bias"](%conv1.7)
      %388 : int[] = prim::ListConstruct(%311, %311)
      %389 : int[] = prim::ListConstruct(%310, %310)
      %390 : int[] = prim::ListConstruct(%311, %311)
      %y0.7 : Tensor = aten::conv2d(%y.7, %weight.44, %bias.44, %388, %389, %390, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out.7 : Tensor = aten::sigmoid(%y0.7) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %y_out0.7 : Tensor = aten::mul(%y_out.7, %y0.7) # /root/NASChainC100/utils_general_v2.py:174:16
      %conv2.7 : __torch__.torch.nn.modules.conv.___torch_mangle_419.Conv2d = prim::GetAttr[name="conv2"](%_6.8)
      %weight.46 : Tensor = prim::GetAttr[name="weight"](%conv2.7)
      %bias.46 : Tensor? = prim::GetAttr[name="bias"](%conv2.7)
      %397 : int[] = prim::ListConstruct(%311, %311)
      %398 : int[] = prim::ListConstruct(%310, %310)
      %399 : int[] = prim::ListConstruct(%311, %311)
      %y_out1.7 : Tensor = aten::conv2d(%y_out0.7, %weight.46, %bias.46, %397, %398, %399, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %y_out2.7 : Tensor = aten::sigmoid(%y_out1.7) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/activation.py:327:15
      %input5.7 : Tensor = aten::mul(%input4.7, %y_out2.7) # /root/NASChainC100/utils_general_v2.py:177:15
      %weight.48 : Tensor = prim::GetAttr[name="weight"](%_7.6)
      %bias.48 : Tensor? = prim::GetAttr[name="bias"](%_7.6)
      %405 : int[] = prim::ListConstruct(%311, %311)
      %406 : int[] = prim::ListConstruct(%310, %310)
      %407 : int[] = prim::ListConstruct(%311, %311)
      %input6.7 : Tensor = aten::conv2d(%input5.7, %weight.48, %bias.48, %405, %406, %407, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/conv.py:549:15
      %training.36 : bool = prim::GetAttr[name="training"](%_8.6)
       = prim::If(%training.36) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:170:11
        block0():
          %num_batches_tracked.18 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_8.6)
          %411 : Tensor = aten::add_(%num_batches_tracked.18, %311, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:173:16
          -> ()
        block1():
          -> ()
      %training.38 : bool = prim::GetAttr[name="training"](%_8.6)
      %running_mean.18 : Tensor = prim::GetAttr[name="running_mean"](%_8.6)
      %running_var.18 : Tensor = prim::GetAttr[name="running_var"](%_8.6)
      %weight.50 : Tensor = prim::GetAttr[name="weight"](%_8.6)
      %bias.50 : Tensor = prim::GetAttr[name="bias"](%_8.6)
       = prim::If(%training.38) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2809:4
        block0():
          %417 : int[] = aten::size(%input6.7) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2810:27
          %size_prods5.2 : int = aten::__getitem__(%417, %310) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2772:17
          %419 : int = aten::len(%417) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %420 : int = aten::sub(%419, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:19
          %size_prods6.1 : int = prim::Loop(%420, %bn_training.4, %size_prods5.2) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2773:4
            block0(%i1.2 : int, %size_prods6.8 : int):
              %424 : int = aten::add(%i1.2, %309) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:27
              %425 : int = aten::__getitem__(%417, %424) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:22
              %size_prods7.2 : int = aten::mul(%size_prods6.8, %425) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2774:8
              -> (%bn_training.4, %size_prods7.2)
          %427 : bool = aten::eq(%size_prods6.1, %311) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:7
           = prim::If(%427) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2775:4
            block0():
              %428 : str = aten::format(%312, %417) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2777:12
               = prim::RaiseException(%428, %313) # /opt/conda/envs/myenv/lib/python3.10/site-packages/torch/nn/functional.py:2776:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
