graph(%self.1 : __torch__.___torch_mangle_334.SimpleCNN,
      %x.1 : Tensor):
  %2 : NoneType = prim::Constant()
  %3 : bool = prim::Constant[value=0]()
  %4 : int = prim::Constant[value=2]() # /home/auto_update_valid_train.py:300:24
  %5 : int = prim::Constant[value=3]() # /home/auto_update_valid_train.py:300:27
  %stem.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="stem"](%self.1)
  %16 : str = prim::Constant[value="none"]()
  %17 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %18 : float = prim::Constant[value=1.0000000000000001e-05]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:204:12
  %19 : str = prim::Constant[value="builtins.ValueError"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:452:18
  %20 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
  %21 : int = prim::Constant[value=2]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:31
  %22 : bool = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2821:8
  %23 : int = prim::Constant[value=0]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:46
  %24 : int = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:33
  %_0.5 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="0"](%stem.1)
  %_1.5 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%stem.1)
  %weight.15 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %bias.15 : Tensor? = prim::GetAttr[name="bias"](%_0.5)
  %29 : int[] = prim::ListConstruct(%24, %24)
  %30 : int[] = prim::ListConstruct(%23, %23)
  %31 : int[] = prim::ListConstruct(%24, %24)
  %input0.5 : Tensor = aten::conv2d(%x.1, %weight.15, %bias.15, %29, %30, %31, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.14 : bool = prim::GetAttr[name="training"](%_1.5)
   = prim::If(%training.14) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.8 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.5)
      %35 : Tensor = aten::add_(%num_batches_tracked.8, %24, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.16 : bool = prim::GetAttr[name="training"](%_1.5)
  %running_mean.8 : Tensor = prim::GetAttr[name="running_mean"](%_1.5)
  %running_var.8 : Tensor = prim::GetAttr[name="running_var"](%_1.5)
  %weight.17 : Tensor = prim::GetAttr[name="weight"](%_1.5)
  %bias.17 : Tensor = prim::GetAttr[name="bias"](%_1.5)
   = prim::If(%training.16) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %41 : int[] = aten::size(%input0.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.8 : int = aten::__getitem__(%41, %23) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %43 : int = aten::len(%41) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %44 : int = aten::sub(%43, %21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.3 : int = prim::Loop(%44, %22, %size_prods.8) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.8 : int, %size_prods0.18 : int):
          %48 : int = aten::add(%i.8, %21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %49 : int = aten::__getitem__(%41, %48) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.8 : int = aten::mul(%size_prods0.18, %49) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%22, %size_prods1.8)
      %51 : bool = aten::eq(%size_prods0.3, %24) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%51) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %52 : str = aten::format(%20, %41) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%52, %19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.4 : Tensor = aten::batch_norm(%input0.5, %weight.17, %bias.17, %running_mean.8, %running_var.8, %training.16, %17, %18, %22) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %x0.1 : Tensor = aten::gelu(%input1.4, %16) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %blocks.1 : __torch__.torch.nn.modules.container.___torch_mangle_333.Sequential = prim::GetAttr[name="blocks"](%self.1)
  %55 : int = prim::Constant[value=728]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %56 : int = prim::Constant[value=312]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %57 : int = prim::Constant[value=144]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %58 : int = prim::Constant[value=96]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %59 : int = prim::Constant[value=64]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %60 : int = prim::Constant[value=1]()
  %61 : str = prim::Constant[value="none"]()
  %62 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %63 : float = prim::Constant[value=1.0000000000000001e-05]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:204:12
  %64 : str = prim::Constant[value="builtins.ValueError"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:452:18
  %65 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
  %66 : int = prim::Constant[value=2]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:31
  %67 : bool = prim::Constant[value=1]() # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2821:8
  %68 : int = prim::Constant[value=0]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:46
  %69 : int = prim::Constant[value=32]() # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:550:75
  %70 : int = prim::Constant[value=-1]() # /home/auto_update_valid_train.py:182:28
  %71 : bool = prim::Constant[value=0]()
  %72 : NoneType = prim::Constant()
  %_0.2 : __torch__.ConvBlock = prim::GetAttr[name="0"](%blocks.1)
  %_1.2 : __torch__.ConvBlock = prim::GetAttr[name="1"](%blocks.1)
  %_2 : __torch__.ConvBlock = prim::GetAttr[name="2"](%blocks.1)
  %_3 : __torch__.ConvBlock = prim::GetAttr[name="3"](%blocks.1)
  %_4 : __torch__.ConvBlock = prim::GetAttr[name="4"](%blocks.1)
  %_5 : __torch__.ConvBlock = prim::GetAttr[name="5"](%blocks.1)
  %_6 : __torch__.ConvBlock = prim::GetAttr[name="6"](%blocks.1)
  %_7 : __torch__.ConvBlock = prim::GetAttr[name="7"](%blocks.1)
  %_8 : __torch__.___torch_mangle_18.ConvBlock = prim::GetAttr[name="8"](%blocks.1)
  %_9 : __torch__.___torch_mangle_29.ConvBlock = prim::GetAttr[name="9"](%blocks.1)
  %_10 : __torch__.___torch_mangle_29.ConvBlock = prim::GetAttr[name="10"](%blocks.1)
  %_11 : __torch__.___torch_mangle_29.ConvBlock = prim::GetAttr[name="11"](%blocks.1)
  %_12 : __torch__.___torch_mangle_307.ConvBlock = prim::GetAttr[name="12"](%blocks.1)
  %_13 : __torch__.___torch_mangle_312.ConvBlock = prim::GetAttr[name="13"](%blocks.1)
  %_14 : __torch__.___torch_mangle_181.ConvBlock = prim::GetAttr[name="14"](%blocks.1)
  %expand_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_0.2)
  %_0.4 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.2)
  %_1.4 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.2)
  %weight.4 : Tensor = prim::GetAttr[name="weight"](%_0.4)
  %bias.4 : Tensor? = prim::GetAttr[name="bias"](%_0.4)
  %93 : int[] = prim::ListConstruct(%60, %60)
  %94 : int[] = prim::ListConstruct(%68, %68)
  %95 : int[] = prim::ListConstruct(%60, %60)
  %input0.7 : Tensor = aten::conv2d(%x0.1, %weight.4, %bias.4, %93, %94, %95, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.3 : bool = prim::GetAttr[name="training"](%_1.4)
   = prim::If(%training.3) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.3 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.4)
      %99 : Tensor = aten::add_(%num_batches_tracked.3, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.5 : bool = prim::GetAttr[name="training"](%_1.4)
  %running_mean.3 : Tensor = prim::GetAttr[name="running_mean"](%_1.4)
  %running_var.3 : Tensor = prim::GetAttr[name="running_var"](%_1.4)
  %weight.6 : Tensor = prim::GetAttr[name="weight"](%_1.4)
  %bias.6 : Tensor = prim::GetAttr[name="bias"](%_1.4)
   = prim::If(%training.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %105 : int[] = aten::size(%input0.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.3 : int = aten::__getitem__(%105, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %107 : int = aten::len(%105) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %108 : int = aten::sub(%107, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.2 : int = prim::Loop(%108, %67, %size_prods.3) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.3 : int, %size_prods0.9 : int):
          %112 : int = aten::add(%i.3, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %113 : int = aten::__getitem__(%105, %112) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.3 : int = aten::mul(%size_prods0.9, %113) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.3)
      %115 : bool = aten::eq(%size_prods0.2, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%115) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %116 : str = aten::format(%65, %105) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%116, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.5 : Tensor = aten::batch_norm(%input0.7, %weight.6, %bias.6, %running_mean.3, %running_var.3, %training.5, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out.2 : Tensor = aten::gelu(%input1.5, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_0.2)
  %_0.6 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.2)
  %_1.6 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.2)
  %weight.8 : Tensor = prim::GetAttr[name="weight"](%_0.6)
  %bias.8 : Tensor? = prim::GetAttr[name="bias"](%_0.6)
  %124 : int[] = prim::ListConstruct(%60, %60)
  %125 : int[] = prim::ListConstruct(%60, %60)
  %126 : int[] = prim::ListConstruct(%60, %60)
  %input0.9 : Tensor = aten::conv2d(%out.2, %weight.8, %bias.8, %124, %125, %126, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.7 : bool = prim::GetAttr[name="training"](%_1.6)
   = prim::If(%training.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.5 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.6)
      %130 : Tensor = aten::add_(%num_batches_tracked.5, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.9 : bool = prim::GetAttr[name="training"](%_1.6)
  %running_mean.5 : Tensor = prim::GetAttr[name="running_mean"](%_1.6)
  %running_var.5 : Tensor = prim::GetAttr[name="running_var"](%_1.6)
  %weight.10 : Tensor = prim::GetAttr[name="weight"](%_1.6)
  %bias.10 : Tensor = prim::GetAttr[name="bias"](%_1.6)
   = prim::If(%training.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %136 : int[] = aten::size(%input0.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.5 : int = aten::__getitem__(%136, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %138 : int = aten::len(%136) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %139 : int = aten::sub(%138, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.11 : int = prim::Loop(%139, %67, %size_prods.5) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.5 : int, %size_prods0.13 : int):
          %143 : int = aten::add(%i.5, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %144 : int = aten::__getitem__(%136, %143) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.5 : int = aten::mul(%size_prods0.13, %144) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.5)
      %146 : bool = aten::eq(%size_prods0.11, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%146) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %147 : str = aten::format(%65, %136) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%147, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.7 : Tensor = aten::batch_norm(%input0.9, %weight.10, %bias.10, %running_mean.5, %running_var.5, %training.9, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.2 : Tensor = aten::gelu(%input1.7, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %srm.2 : __torch__.SRMLayer = prim::GetAttr[name="srm"](%_0.2)
  %151 : int[] = aten::size(%out0.2) # /home/auto_update_valid_train.py:179:21
  %b.2 : int, %c.2 : int, %154 : int, %155 : int = prim::ListUnpack(%151)
  %156 : int[] = prim::ListConstruct(%b.2, %c.2, %70)
  %157 : Tensor = aten::view(%out0.2, %156) # /home/auto_update_valid_train.py:182:15
  %158 : int[] = prim::ListConstruct(%70)
  %159 : Tensor = aten::mean(%157, %158, %71, %72) # /home/auto_update_valid_train.py:182:15
  %mean.2 : Tensor = aten::unsqueeze(%159, %70) # /home/auto_update_valid_train.py:182:15
  %161 : int[] = prim::ListConstruct(%b.2, %c.2, %70)
  %162 : Tensor = aten::view(%out0.2, %161) # /home/auto_update_valid_train.py:183:14
  %163 : int[] = prim::ListConstruct(%70)
  %164 : Tensor = aten::std(%162, %163, %67, %71) # /home/auto_update_valid_train.py:183:14
  %std.2 : Tensor = aten::unsqueeze(%164, %70) # /home/auto_update_valid_train.py:183:14
  %166 : Tensor[] = prim::ListConstruct(%mean.2, %std.2)
  %u.2 : Tensor = aten::cat(%166, %70) # /home/auto_update_valid_train.py:184:12
  %cfc.2 : __torch__.torch.nn.modules.conv.Conv1d = prim::GetAttr[name="cfc"](%srm.2)
  %weight.12 : Tensor = prim::GetAttr[name="weight"](%cfc.2)
  %bias.12 : Tensor? = prim::GetAttr[name="bias"](%cfc.2)
  %171 : int[] = prim::ListConstruct(%60)
  %172 : int[] = prim::ListConstruct(%68)
  %173 : int[] = prim::ListConstruct(%60)
  %z.2 : Tensor = aten::conv1d(%u.2, %weight.12, %bias.12, %171, %172, %173, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:370:15
  %bn.2 : __torch__.torch.nn.modules.batchnorm.BatchNorm1d = prim::GetAttr[name="bn"](%srm.2)
  %training.11 : bool = prim::GetAttr[name="training"](%bn.2)
   = prim::If(%training.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.7 : Tensor = prim::GetAttr[name="num_batches_tracked"](%bn.2)
      %178 : Tensor = aten::add_(%num_batches_tracked.7, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.13 : bool = prim::GetAttr[name="training"](%bn.2)
  %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%bn.2)
  %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%bn.2)
  %weight.14 : Tensor = prim::GetAttr[name="weight"](%bn.2)
  %bias.14 : Tensor = prim::GetAttr[name="bias"](%bn.2)
   = prim::If(%training.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %184 : int[] = aten::size(%z.2) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.7 : int = aten::__getitem__(%184, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %186 : int = aten::len(%184) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %187 : int = aten::sub(%186, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.15 : int = prim::Loop(%187, %67, %size_prods.7) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.7 : int, %size_prods0.17 : int):
          %191 : int = aten::add(%i.7, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %192 : int = aten::__getitem__(%184, %191) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.7 : int = aten::mul(%size_prods0.17, %192) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.7)
      %194 : bool = aten::eq(%size_prods0.15, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%194) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %195 : str = aten::format(%65, %184) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%195, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %z0.2 : Tensor = aten::batch_norm(%z.2, %weight.14, %bias.14, %running_mean.7, %running_var.7, %training.13, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %g.2 : Tensor = aten::sigmoid(%z0.2) # /home/auto_update_valid_train.py:189:12
  %198 : int[] = prim::ListConstruct(%b.2, %c.2, %60, %60)
  %g0.2 : Tensor = aten::view(%g.2, %198) # /home/auto_update_valid_train.py:190:12
  %200 : Tensor = aten::expand_as(%g0.2, %out0.2) # /home/auto_update_valid_train.py:192:19
  %out1.2 : Tensor = aten::mul(%out0.2, %200) # /home/auto_update_valid_train.py:192:15
  %project_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_6.Sequential = prim::GetAttr[name="project_conv"](%_0.2)
  %_0.8 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="0"](%project_conv.2)
  %_1.8 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.2)
  %weight.16 : Tensor = prim::GetAttr[name="weight"](%_0.8)
  %bias.16 : Tensor? = prim::GetAttr[name="bias"](%_0.8)
  %207 : int[] = prim::ListConstruct(%60, %60)
  %208 : int[] = prim::ListConstruct(%68, %68)
  %209 : int[] = prim::ListConstruct(%60, %60)
  %input0.11 : Tensor = aten::conv2d(%out1.2, %weight.16, %bias.16, %207, %208, %209, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.15 : bool = prim::GetAttr[name="training"](%_1.8)
   = prim::If(%training.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.9 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.8)
      %213 : Tensor = aten::add_(%num_batches_tracked.9, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.17 : bool = prim::GetAttr[name="training"](%_1.8)
  %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%_1.8)
  %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%_1.8)
  %weight.18 : Tensor = prim::GetAttr[name="weight"](%_1.8)
  %bias.18 : Tensor = prim::GetAttr[name="bias"](%_1.8)
   = prim::If(%training.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %219 : int[] = aten::size(%input0.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.9 : int = aten::__getitem__(%219, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %221 : int = aten::len(%219) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %222 : int = aten::sub(%221, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.19 : int = prim::Loop(%222, %67, %size_prods.9) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.9 : int, %size_prods0.21 : int):
          %226 : int = aten::add(%i.9, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %227 : int = aten::__getitem__(%219, %226) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.9 : int = aten::mul(%size_prods0.21, %227) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.9)
      %229 : bool = aten::eq(%size_prods0.19, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%229) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %230 : str = aten::format(%65, %219) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%230, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.2 : Tensor = aten::batch_norm(%input0.11, %weight.18, %bias.18, %running_mean.9, %running_var.9, %training.17, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.2 : bool = prim::GetAttr[name="use_residual"](%_0.2)
  %input0.3 : Tensor = prim::If(%use_residual.2) # /home/auto_update_valid_train.py:261:8
    block0():
      %out3.2 : Tensor = aten::add(%out2.2, %x0.1, %60) # /home/auto_update_valid_train.py:263:18
      -> (%out3.2)
    block1():
      -> (%out2.2)
  %expand_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_1.2)
  %_0.10 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.4)
  %_1.10 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.4)
  %weight.20 : Tensor = prim::GetAttr[name="weight"](%_0.10)
  %bias.20 : Tensor? = prim::GetAttr[name="bias"](%_0.10)
  %240 : int[] = prim::ListConstruct(%60, %60)
  %241 : int[] = prim::ListConstruct(%68, %68)
  %242 : int[] = prim::ListConstruct(%60, %60)
  %input0.13 : Tensor = aten::conv2d(%input0.3, %weight.20, %bias.20, %240, %241, %242, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.19 : bool = prim::GetAttr[name="training"](%_1.10)
   = prim::If(%training.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.11 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.10)
      %246 : Tensor = aten::add_(%num_batches_tracked.11, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.21 : bool = prim::GetAttr[name="training"](%_1.10)
  %running_mean.11 : Tensor = prim::GetAttr[name="running_mean"](%_1.10)
  %running_var.11 : Tensor = prim::GetAttr[name="running_var"](%_1.10)
  %weight.22 : Tensor = prim::GetAttr[name="weight"](%_1.10)
  %bias.22 : Tensor = prim::GetAttr[name="bias"](%_1.10)
   = prim::If(%training.21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %252 : int[] = aten::size(%input0.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.11 : int = aten::__getitem__(%252, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %254 : int = aten::len(%252) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %255 : int = aten::sub(%254, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.23 : int = prim::Loop(%255, %67, %size_prods.11) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.11 : int, %size_prods0.25 : int):
          %259 : int = aten::add(%i.11, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %260 : int = aten::__getitem__(%252, %259) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.11 : int = aten::mul(%size_prods0.25, %260) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.11)
      %262 : bool = aten::eq(%size_prods0.23, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%262) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %263 : str = aten::format(%65, %252) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%263, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.11 : Tensor = aten::batch_norm(%input0.13, %weight.22, %bias.22, %running_mean.11, %running_var.11, %training.21, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out.4 : Tensor = aten::gelu(%input1.11, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_1.2)
  %_0.12 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.4)
  %_1.12 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.4)
  %weight.24 : Tensor = prim::GetAttr[name="weight"](%_0.12)
  %bias.24 : Tensor? = prim::GetAttr[name="bias"](%_0.12)
  %271 : int[] = prim::ListConstruct(%60, %60)
  %272 : int[] = prim::ListConstruct(%60, %60)
  %273 : int[] = prim::ListConstruct(%60, %60)
  %input0.15 : Tensor = aten::conv2d(%out.4, %weight.24, %bias.24, %271, %272, %273, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.23 : bool = prim::GetAttr[name="training"](%_1.12)
   = prim::If(%training.23) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.13 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.12)
      %277 : Tensor = aten::add_(%num_batches_tracked.13, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.25 : bool = prim::GetAttr[name="training"](%_1.12)
  %running_mean.13 : Tensor = prim::GetAttr[name="running_mean"](%_1.12)
  %running_var.13 : Tensor = prim::GetAttr[name="running_var"](%_1.12)
  %weight.26 : Tensor = prim::GetAttr[name="weight"](%_1.12)
  %bias.26 : Tensor = prim::GetAttr[name="bias"](%_1.12)
   = prim::If(%training.25) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %283 : int[] = aten::size(%input0.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.13 : int = aten::__getitem__(%283, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %285 : int = aten::len(%283) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %286 : int = aten::sub(%285, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.27 : int = prim::Loop(%286, %67, %size_prods.13) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.13 : int, %size_prods0.29 : int):
          %290 : int = aten::add(%i.13, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %291 : int = aten::__getitem__(%283, %290) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.13 : int = aten::mul(%size_prods0.29, %291) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.13)
      %293 : bool = aten::eq(%size_prods0.27, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%293) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %294 : str = aten::format(%65, %283) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%294, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.13 : Tensor = aten::batch_norm(%input0.15, %weight.26, %bias.26, %running_mean.13, %running_var.13, %training.25, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.4 : Tensor = aten::gelu(%input1.13, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %srm.4 : __torch__.SRMLayer = prim::GetAttr[name="srm"](%_1.2)
  %298 : int[] = aten::size(%out0.4) # /home/auto_update_valid_train.py:179:21
  %b.4 : int, %c.4 : int, %301 : int, %302 : int = prim::ListUnpack(%298)
  %303 : int[] = prim::ListConstruct(%b.4, %c.4, %70)
  %304 : Tensor = aten::view(%out0.4, %303) # /home/auto_update_valid_train.py:182:15
  %305 : int[] = prim::ListConstruct(%70)
  %306 : Tensor = aten::mean(%304, %305, %71, %72) # /home/auto_update_valid_train.py:182:15
  %mean.4 : Tensor = aten::unsqueeze(%306, %70) # /home/auto_update_valid_train.py:182:15
  %308 : int[] = prim::ListConstruct(%b.4, %c.4, %70)
  %309 : Tensor = aten::view(%out0.4, %308) # /home/auto_update_valid_train.py:183:14
  %310 : int[] = prim::ListConstruct(%70)
  %311 : Tensor = aten::std(%309, %310, %67, %71) # /home/auto_update_valid_train.py:183:14
  %std.4 : Tensor = aten::unsqueeze(%311, %70) # /home/auto_update_valid_train.py:183:14
  %313 : Tensor[] = prim::ListConstruct(%mean.4, %std.4)
  %u.4 : Tensor = aten::cat(%313, %70) # /home/auto_update_valid_train.py:184:12
  %cfc.4 : __torch__.torch.nn.modules.conv.Conv1d = prim::GetAttr[name="cfc"](%srm.4)
  %weight.28 : Tensor = prim::GetAttr[name="weight"](%cfc.4)
  %bias.28 : Tensor? = prim::GetAttr[name="bias"](%cfc.4)
  %318 : int[] = prim::ListConstruct(%60)
  %319 : int[] = prim::ListConstruct(%68)
  %320 : int[] = prim::ListConstruct(%60)
  %z.4 : Tensor = aten::conv1d(%u.4, %weight.28, %bias.28, %318, %319, %320, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:370:15
  %bn.4 : __torch__.torch.nn.modules.batchnorm.BatchNorm1d = prim::GetAttr[name="bn"](%srm.4)
  %training.27 : bool = prim::GetAttr[name="training"](%bn.4)
   = prim::If(%training.27) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.15 : Tensor = prim::GetAttr[name="num_batches_tracked"](%bn.4)
      %325 : Tensor = aten::add_(%num_batches_tracked.15, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.29 : bool = prim::GetAttr[name="training"](%bn.4)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%bn.4)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%bn.4)
  %weight.30 : Tensor = prim::GetAttr[name="weight"](%bn.4)
  %bias.30 : Tensor = prim::GetAttr[name="bias"](%bn.4)
   = prim::If(%training.29) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %331 : int[] = aten::size(%z.4) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.15 : int = aten::__getitem__(%331, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %333 : int = aten::len(%331) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %334 : int = aten::sub(%333, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.31 : int = prim::Loop(%334, %67, %size_prods.15) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.15 : int, %size_prods0.33 : int):
          %338 : int = aten::add(%i.15, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %339 : int = aten::__getitem__(%331, %338) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.15 : int = aten::mul(%size_prods0.33, %339) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.15)
      %341 : bool = aten::eq(%size_prods0.31, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%341) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %342 : str = aten::format(%65, %331) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%342, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %z0.4 : Tensor = aten::batch_norm(%z.4, %weight.30, %bias.30, %running_mean.15, %running_var.15, %training.29, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %g.4 : Tensor = aten::sigmoid(%z0.4) # /home/auto_update_valid_train.py:189:12
  %345 : int[] = prim::ListConstruct(%b.4, %c.4, %60, %60)
  %g0.4 : Tensor = aten::view(%g.4, %345) # /home/auto_update_valid_train.py:190:12
  %347 : Tensor = aten::expand_as(%g0.4, %out0.4) # /home/auto_update_valid_train.py:192:19
  %out1.4 : Tensor = aten::mul(%out0.4, %347) # /home/auto_update_valid_train.py:192:15
  %project_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_6.Sequential = prim::GetAttr[name="project_conv"](%_1.2)
  %_0.14 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="0"](%project_conv.4)
  %_1.14 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.4)
  %weight.32 : Tensor = prim::GetAttr[name="weight"](%_0.14)
  %bias.32 : Tensor? = prim::GetAttr[name="bias"](%_0.14)
  %354 : int[] = prim::ListConstruct(%60, %60)
  %355 : int[] = prim::ListConstruct(%68, %68)
  %356 : int[] = prim::ListConstruct(%60, %60)
  %input0.17 : Tensor = aten::conv2d(%out1.4, %weight.32, %bias.32, %354, %355, %356, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.31 : bool = prim::GetAttr[name="training"](%_1.14)
   = prim::If(%training.31) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.17 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.14)
      %360 : Tensor = aten::add_(%num_batches_tracked.17, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.33 : bool = prim::GetAttr[name="training"](%_1.14)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%_1.14)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%_1.14)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%_1.14)
  %bias.34 : Tensor = prim::GetAttr[name="bias"](%_1.14)
   = prim::If(%training.33) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %366 : int[] = aten::size(%input0.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.17 : int = aten::__getitem__(%366, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %368 : int = aten::len(%366) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %369 : int = aten::sub(%368, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.35 : int = prim::Loop(%369, %67, %size_prods.17) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.17 : int, %size_prods0.37 : int):
          %373 : int = aten::add(%i.17, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %374 : int = aten::__getitem__(%366, %373) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.17 : int = aten::mul(%size_prods0.37, %374) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.17)
      %376 : bool = aten::eq(%size_prods0.35, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%376) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %377 : str = aten::format(%65, %366) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%377, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.4 : Tensor = aten::batch_norm(%input0.17, %weight.34, %bias.34, %running_mean.17, %running_var.17, %training.33, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %use_residual.4 : bool = prim::GetAttr[name="use_residual"](%_1.2)
  %input1.3 : Tensor = prim::If(%use_residual.4) # /home/auto_update_valid_train.py:261:8
    block0():
      %out3.4 : Tensor = aten::add(%out2.4, %input0.3, %60) # /home/auto_update_valid_train.py:263:18
      -> (%out3.4)
    block1():
      -> (%out2.4)
  %expand_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_2)
  %_0.16 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.6)
  %_1.16 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.6)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%_0.16)
  %bias.36 : Tensor? = prim::GetAttr[name="bias"](%_0.16)
  %387 : int[] = prim::ListConstruct(%60, %60)
  %388 : int[] = prim::ListConstruct(%68, %68)
  %389 : int[] = prim::ListConstruct(%60, %60)
  %input0.19 : Tensor = aten::conv2d(%input1.3, %weight.36, %bias.36, %387, %388, %389, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.35 : bool = prim::GetAttr[name="training"](%_1.16)
   = prim::If(%training.35) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.19 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.16)
      %393 : Tensor = aten::add_(%num_batches_tracked.19, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.37 : bool = prim::GetAttr[name="training"](%_1.16)
  %running_mean.19 : Tensor = prim::GetAttr[name="running_mean"](%_1.16)
  %running_var.19 : Tensor = prim::GetAttr[name="running_var"](%_1.16)
  %weight.38 : Tensor = prim::GetAttr[name="weight"](%_1.16)
  %bias.38 : Tensor = prim::GetAttr[name="bias"](%_1.16)
   = prim::If(%training.37) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %399 : int[] = aten::size(%input0.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.19 : int = aten::__getitem__(%399, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %401 : int = aten::len(%399) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %402 : int = aten::sub(%401, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.39 : int = prim::Loop(%402, %67, %size_prods.19) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.19 : int, %size_prods0.41 : int):
          %406 : int = aten::add(%i.19, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %407 : int = aten::__getitem__(%399, %406) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.19 : int = aten::mul(%size_prods0.41, %407) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.19)
      %409 : bool = aten::eq(%size_prods0.39, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%409) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %410 : str = aten::format(%65, %399) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%410, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.15 : Tensor = aten::batch_norm(%input0.19, %weight.38, %bias.38, %running_mean.19, %running_var.19, %training.37, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out.6 : Tensor = aten::gelu(%input1.15, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_2)
  %_0.18 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.6)
  %_1.18 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.6)
  %weight.40 : Tensor = prim::GetAttr[name="weight"](%_0.18)
  %bias.40 : Tensor? = prim::GetAttr[name="bias"](%_0.18)
  %418 : int[] = prim::ListConstruct(%60, %60)
  %419 : int[] = prim::ListConstruct(%60, %60)
  %420 : int[] = prim::ListConstruct(%60, %60)
  %input0.21 : Tensor = aten::conv2d(%out.6, %weight.40, %bias.40, %418, %419, %420, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:549:15
  %training.39 : bool = prim::GetAttr[name="training"](%_1.18)
   = prim::If(%training.39) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.21 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.18)
      %424 : Tensor = aten::add_(%num_batches_tracked.21, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.41 : bool = prim::GetAttr[name="training"](%_1.18)
  %running_mean.21 : Tensor = prim::GetAttr[name="running_mean"](%_1.18)
  %running_var.21 : Tensor = prim::GetAttr[name="running_var"](%_1.18)
  %weight.42 : Tensor = prim::GetAttr[name="weight"](%_1.18)
  %bias.42 : Tensor = prim::GetAttr[name="bias"](%_1.18)
   = prim::If(%training.41) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %430 : int[] = aten::size(%input0.21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.21 : int = aten::__getitem__(%430, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
      %432 : int = aten::len(%430) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %433 : int = aten::sub(%432, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:19
      %size_prods0.43 : int = prim::Loop(%433, %67, %size_prods.21) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2773:4
        block0(%i.21 : int, %size_prods0.45 : int):
          %437 : int = aten::add(%i.21, %66) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:27
          %438 : int = aten::__getitem__(%430, %437) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:22
          %size_prods1.21 : int = aten::mul(%size_prods0.45, %438) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.21)
      %440 : bool = aten::eq(%size_prods0.43, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:7
       = prim::If(%440) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2775:4
        block0():
          %441 : str = aten::format(%65, %430) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%441, %64) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.17 : Tensor = aten::batch_norm(%input0.21, %weight.42, %bias.42, %running_mean.21, %running_var.21, %training.41, %62, %63, %67) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2812:11
  %out0.6 : Tensor = aten::gelu(%input1.17, %61) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/activation.py:734:15
  %srm.6 : __torch__.SRMLayer = prim::GetAttr[name="srm"](%_2)
  %445 : int[] = aten::size(%out0.6) # /home/auto_update_valid_train.py:179:21
  %b.6 : int, %c.6 : int, %448 : int, %449 : int = prim::ListUnpack(%445)
  %450 : int[] = prim::ListConstruct(%b.6, %c.6, %70)
  %451 : Tensor = aten::view(%out0.6, %450) # /home/auto_update_valid_train.py:182:15
  %452 : int[] = prim::ListConstruct(%70)
  %453 : Tensor = aten::mean(%451, %452, %71, %72) # /home/auto_update_valid_train.py:182:15
  %mean.6 : Tensor = aten::unsqueeze(%453, %70) # /home/auto_update_valid_train.py:182:15
  %455 : int[] = prim::ListConstruct(%b.6, %c.6, %70)
  %456 : Tensor = aten::view(%out0.6, %455) # /home/auto_update_valid_train.py:183:14
  %457 : int[] = prim::ListConstruct(%70)
  %458 : Tensor = aten::std(%456, %457, %67, %71) # /home/auto_update_valid_train.py:183:14
  %std.6 : Tensor = aten::unsqueeze(%458, %70) # /home/auto_update_valid_train.py:183:14
  %460 : Tensor[] = prim::ListConstruct(%mean.6, %std.6)
  %u.6 : Tensor = aten::cat(%460, %70) # /home/auto_update_valid_train.py:184:12
  %cfc.6 : __torch__.torch.nn.modules.conv.Conv1d = prim::GetAttr[name="cfc"](%srm.6)
  %weight.44 : Tensor = prim::GetAttr[name="weight"](%cfc.6)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%cfc.6)
  %465 : int[] = prim::ListConstruct(%60)
  %466 : int[] = prim::ListConstruct(%68)
  %467 : int[] = prim::ListConstruct(%60)
  %z.6 : Tensor = aten::conv1d(%u.6, %weight.44, %bias.44, %465, %466, %467, %69) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/conv.py:370:15
  %bn.6 : __torch__.torch.nn.modules.batchnorm.BatchNorm1d = prim::GetAttr[name="bn"](%srm.6)
  %training.43 : bool = prim::GetAttr[name="training"](%bn.6)
   = prim::If(%training.43) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.23 : Tensor = prim::GetAttr[name="num_batches_tracked"](%bn.6)
      %472 : Tensor = aten::add_(%num_batches_tracked.23, %60, %60) # /usr/local/lib/python3.10/dist-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.45 : bool = prim::GetAttr[name="training"](%bn.6)
  %running_mean.23 : Tensor = prim::GetAttr[name="running_mean"](%bn.6)
  %running_var.23 : Tensor = prim::GetAttr[name="running_var"](%bn.6)
  %weight.46 : Tensor = prim::GetAttr[name="weight"](%bn.6)
  %bias.46 : Tensor = prim::GetAttr[name="bias"](%bn.6)
   = prim::If(%training.45) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2809:4
    block0():
      %478 : int[] = aten::size(%z.6) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2810:27
      %size_prods.23 : int = aten::__getitem__(%478, %68) # /usr/local/lib/python3.10/dist-packages/torch/nn/functional.py:2772:17
