graph(%self.1 : __torch__.___torch_mangle_1364.SimpleCNN,
      %x.1 : Tensor):
  %2 : NoneType = prim::Constant()
  %3 : bool = prim::Constant[value=0]()
  %4 : int = prim::Constant[value=2]() # /home/auto_update_valid_train.py:299:24
  %5 : int = prim::Constant[value=3]() # /home/auto_update_valid_train.py:299:27
  %stem.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="stem"](%self.1)
  %16 : str = prim::Constant[value="none"]()
  %17 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %18 : float = prim::Constant[value=1.0000000000000001e-05]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:204:12
  %19 : str = prim::Constant[value="builtins.ValueError"]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:452:18
  %20 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
  %21 : int = prim::Constant[value=2]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:31
  %22 : bool = prim::Constant[value=1]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2821:8
  %23 : int = prim::Constant[value=0]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:46
  %24 : int = prim::Constant[value=1]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:33
  %_0.5 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="0"](%stem.1)
  %_1.5 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%stem.1)
  %weight.15 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %bias.15 : Tensor? = prim::GetAttr[name="bias"](%_0.5)
  %29 : int[] = prim::ListConstruct(%24, %24)
  %30 : int[] = prim::ListConstruct(%23, %23)
  %31 : int[] = prim::ListConstruct(%24, %24)
  %input0.5 : Tensor = aten::conv2d(%x.1, %weight.15, %bias.15, %29, %30, %31, %24) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.10 : bool = prim::GetAttr[name="training"](%_1.5)
   = prim::If(%training.10) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.6 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.5)
      %35 : Tensor = aten::add_(%num_batches_tracked.6, %24, %24) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.12 : bool = prim::GetAttr[name="training"](%_1.5)
  %running_mean.6 : Tensor = prim::GetAttr[name="running_mean"](%_1.5)
  %running_var.6 : Tensor = prim::GetAttr[name="running_var"](%_1.5)
  %weight.17 : Tensor = prim::GetAttr[name="weight"](%_1.5)
  %bias.17 : Tensor = prim::GetAttr[name="bias"](%_1.5)
   = prim::If(%training.12) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %41 : int[] = aten::size(%input0.5) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.6 : int = aten::__getitem__(%41, %23) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %43 : int = aten::len(%41) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %44 : int = aten::sub(%43, %21) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.3 : int = prim::Loop(%44, %22, %size_prods.6) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.6 : int, %size_prods0.14 : int):
          %48 : int = aten::add(%i.6, %21) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %49 : int = aten::__getitem__(%41, %48) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.6 : int = aten::mul(%size_prods0.14, %49) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%22, %size_prods1.6)
      %51 : bool = aten::eq(%size_prods0.3, %24) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%51) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %52 : str = aten::format(%20, %41) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%52, %19) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.4 : Tensor = aten::batch_norm(%input0.5, %weight.17, %bias.17, %running_mean.6, %running_var.6, %training.12, %17, %18, %22) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %x0.1 : Tensor = aten::gelu(%input1.4, %16) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %blocks.1 : __torch__.torch.nn.modules.container.___torch_mangle_1363.Sequential = prim::GetAttr[name="blocks"](%self.1)
  %55 : int = prim::Constant[value=676]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %56 : int = prim::Constant[value=572]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %57 : int = prim::Constant[value=264]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %58 : int = prim::Constant[value=168]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %59 : int = prim::Constant[value=112]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %60 : int = prim::Constant[value=1]()
  %61 : str = prim::Constant[value="none"]()
  %62 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %63 : float = prim::Constant[value=1.0000000000000001e-05]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:204:12
  %64 : str = prim::Constant[value="builtins.ValueError"]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:452:18
  %65 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
  %66 : int = prim::Constant[value=2]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:31
  %67 : bool = prim::Constant[value=1]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2821:8
  %68 : int = prim::Constant[value=0]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:46
  %69 : int = prim::Constant[value=32]() # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:550:75
  %70 : int = prim::Constant[value=3]() # /home/auto_update_valid_train.py:37:27
  %71 : NoneType = prim::Constant()
  %_0.2 : __torch__.ConvBlock = prim::GetAttr[name="0"](%blocks.1)
  %_1.2 : __torch__.ConvBlock = prim::GetAttr[name="1"](%blocks.1)
  %_2 : __torch__.ConvBlock = prim::GetAttr[name="2"](%blocks.1)
  %_3 : __torch__.ConvBlock = prim::GetAttr[name="3"](%blocks.1)
  %_4 : __torch__.ConvBlock = prim::GetAttr[name="4"](%blocks.1)
  %_5 : __torch__.ConvBlock = prim::GetAttr[name="5"](%blocks.1)
  %_6 : __torch__.___torch_mangle_1163.ConvBlock = prim::GetAttr[name="6"](%blocks.1)
  %_7 : __torch__.___torch_mangle_1168.ConvBlock = prim::GetAttr[name="7"](%blocks.1)
  %_8 : __torch__.___torch_mangle_1168.ConvBlock = prim::GetAttr[name="8"](%blocks.1)
  %_9 : __torch__.___torch_mangle_1168.ConvBlock = prim::GetAttr[name="9"](%blocks.1)
  %_10 : __torch__.___torch_mangle_494.ConvBlock = prim::GetAttr[name="10"](%blocks.1)
  %_11 : __torch__.___torch_mangle_499.ConvBlock = prim::GetAttr[name="11"](%blocks.1)
  %_12 : __torch__.___torch_mangle_143.ConvBlock = prim::GetAttr[name="12"](%blocks.1)
  %expand_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_0.2)
  %_0.4 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.2)
  %_1.4 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.2)
  %weight.4 : Tensor = prim::GetAttr[name="weight"](%_0.4)
  %bias.4 : Tensor? = prim::GetAttr[name="bias"](%_0.4)
  %90 : int[] = prim::ListConstruct(%60, %60)
  %91 : int[] = prim::ListConstruct(%68, %68)
  %92 : int[] = prim::ListConstruct(%60, %60)
  %input0.7 : Tensor = aten::conv2d(%x0.1, %weight.4, %bias.4, %90, %91, %92, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.3 : bool = prim::GetAttr[name="training"](%_1.4)
   = prim::If(%training.3) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.3 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.4)
      %96 : Tensor = aten::add_(%num_batches_tracked.3, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.5 : bool = prim::GetAttr[name="training"](%_1.4)
  %running_mean.3 : Tensor = prim::GetAttr[name="running_mean"](%_1.4)
  %running_var.3 : Tensor = prim::GetAttr[name="running_var"](%_1.4)
  %weight.6 : Tensor = prim::GetAttr[name="weight"](%_1.4)
  %bias.6 : Tensor = prim::GetAttr[name="bias"](%_1.4)
   = prim::If(%training.5) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %102 : int[] = aten::size(%input0.7) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.3 : int = aten::__getitem__(%102, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %104 : int = aten::len(%102) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %105 : int = aten::sub(%104, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.2 : int = prim::Loop(%105, %67, %size_prods.3) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.3 : int, %size_prods0.9 : int):
          %109 : int = aten::add(%i.3, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %110 : int = aten::__getitem__(%102, %109) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.3 : int = aten::mul(%size_prods0.9, %110) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.3)
      %112 : bool = aten::eq(%size_prods0.2, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%112) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %113 : str = aten::format(%65, %102) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%113, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.5 : Tensor = aten::batch_norm(%input0.7, %weight.6, %bias.6, %running_mean.3, %running_var.3, %training.5, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out.2 : Tensor = aten::gelu(%input1.5, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_0.2)
  %_0.6 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.2)
  %_1.6 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.2)
  %weight.8 : Tensor = prim::GetAttr[name="weight"](%_0.6)
  %bias.8 : Tensor? = prim::GetAttr[name="bias"](%_0.6)
  %121 : int[] = prim::ListConstruct(%60, %60)
  %122 : int[] = prim::ListConstruct(%60, %60)
  %123 : int[] = prim::ListConstruct(%60, %60)
  %input0.9 : Tensor = aten::conv2d(%out.2, %weight.8, %bias.8, %121, %122, %123, %69) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.7 : bool = prim::GetAttr[name="training"](%_1.6)
   = prim::If(%training.7) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.5 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.6)
      %127 : Tensor = aten::add_(%num_batches_tracked.5, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.9 : bool = prim::GetAttr[name="training"](%_1.6)
  %running_mean.5 : Tensor = prim::GetAttr[name="running_mean"](%_1.6)
  %running_var.5 : Tensor = prim::GetAttr[name="running_var"](%_1.6)
  %weight.10 : Tensor = prim::GetAttr[name="weight"](%_1.6)
  %bias.10 : Tensor = prim::GetAttr[name="bias"](%_1.6)
   = prim::If(%training.9) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %133 : int[] = aten::size(%input0.9) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.5 : int = aten::__getitem__(%133, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %135 : int = aten::len(%133) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %136 : int = aten::sub(%135, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.11 : int = prim::Loop(%136, %67, %size_prods.5) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.5 : int, %size_prods0.13 : int):
          %140 : int = aten::add(%i.5, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %141 : int = aten::__getitem__(%133, %140) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.5 : int = aten::mul(%size_prods0.13, %141) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.5)
      %143 : bool = aten::eq(%size_prods0.11, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%143) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %144 : str = aten::format(%65, %133) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%144, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.7 : Tensor = aten::batch_norm(%input0.9, %weight.10, %bias.10, %running_mean.5, %running_var.5, %training.9, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out0.2 : Tensor = aten::gelu(%input1.7, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %se.2 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_0.2)
  %148 : int[] = prim::ListConstruct(%66, %70)
  %y.2 : Tensor = aten::mean(%out0.2, %148, %67, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.2 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc1"](%se.2)
  %weight.12 : Tensor = prim::GetAttr[name="weight"](%fc1.2)
  %bias.12 : Tensor? = prim::GetAttr[name="bias"](%fc1.2)
  %153 : int[] = prim::ListConstruct(%60, %60)
  %154 : int[] = prim::ListConstruct(%68, %68)
  %155 : int[] = prim::ListConstruct(%60, %60)
  %y0.2 : Tensor = aten::conv2d(%y.2, %weight.12, %bias.12, %153, %154, %155, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act1.2 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.2)
  %y1.2 : Tensor = aten::gelu(%y0.2, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %fc2.2 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc2"](%se.2)
  %weight.14 : Tensor = prim::GetAttr[name="weight"](%fc2.2)
  %bias.14 : Tensor? = prim::GetAttr[name="bias"](%fc2.2)
  %162 : int[] = prim::ListConstruct(%60, %60)
  %163 : int[] = prim::ListConstruct(%68, %68)
  %164 : int[] = prim::ListConstruct(%60, %60)
  %y2.2 : Tensor = aten::conv2d(%y1.2, %weight.14, %bias.14, %162, %163, %164, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act2.2 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.2)
  %y3.2 : Tensor = aten::sigmoid(%y2.2) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:327:15
  %out1.2 : Tensor = aten::mul(%out0.2, %y3.2) # /home/auto_update_valid_train.py:42:15
  %project_conv.2 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="project_conv"](%_0.2)
  %_0.8 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%project_conv.2)
  %_1.8 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.2)
  %weight.16 : Tensor = prim::GetAttr[name="weight"](%_0.8)
  %bias.16 : Tensor? = prim::GetAttr[name="bias"](%_0.8)
  %174 : int[] = prim::ListConstruct(%60, %60)
  %175 : int[] = prim::ListConstruct(%68, %68)
  %176 : int[] = prim::ListConstruct(%60, %60)
  %input0.11 : Tensor = aten::conv2d(%out1.2, %weight.16, %bias.16, %174, %175, %176, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.11 : bool = prim::GetAttr[name="training"](%_1.8)
   = prim::If(%training.11) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.7 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.8)
      %180 : Tensor = aten::add_(%num_batches_tracked.7, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.13 : bool = prim::GetAttr[name="training"](%_1.8)
  %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%_1.8)
  %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%_1.8)
  %weight.18 : Tensor = prim::GetAttr[name="weight"](%_1.8)
  %bias.18 : Tensor = prim::GetAttr[name="bias"](%_1.8)
   = prim::If(%training.13) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %186 : int[] = aten::size(%input0.11) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.7 : int = aten::__getitem__(%186, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %188 : int = aten::len(%186) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %189 : int = aten::sub(%188, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.15 : int = prim::Loop(%189, %67, %size_prods.7) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.7 : int, %size_prods0.17 : int):
          %193 : int = aten::add(%i.7, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %194 : int = aten::__getitem__(%186, %193) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.7 : int = aten::mul(%size_prods0.17, %194) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.7)
      %196 : bool = aten::eq(%size_prods0.15, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%196) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %197 : str = aten::format(%65, %186) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%197, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.2 : Tensor = aten::batch_norm(%input0.11, %weight.18, %bias.18, %running_mean.7, %running_var.7, %training.13, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %use_residual.2 : bool = prim::GetAttr[name="use_residual"](%_0.2)
  %input0.3 : Tensor = prim::If(%use_residual.2) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.2 : Tensor = aten::add(%out2.2, %x0.1, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.2)
    block1():
      -> (%out2.2)
  %expand_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_1.2)
  %_0.10 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.4)
  %_1.10 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.4)
  %weight.20 : Tensor = prim::GetAttr[name="weight"](%_0.10)
  %bias.20 : Tensor? = prim::GetAttr[name="bias"](%_0.10)
  %207 : int[] = prim::ListConstruct(%60, %60)
  %208 : int[] = prim::ListConstruct(%68, %68)
  %209 : int[] = prim::ListConstruct(%60, %60)
  %input0.13 : Tensor = aten::conv2d(%input0.3, %weight.20, %bias.20, %207, %208, %209, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.15 : bool = prim::GetAttr[name="training"](%_1.10)
   = prim::If(%training.15) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.9 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.10)
      %213 : Tensor = aten::add_(%num_batches_tracked.9, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.17 : bool = prim::GetAttr[name="training"](%_1.10)
  %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%_1.10)
  %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%_1.10)
  %weight.22 : Tensor = prim::GetAttr[name="weight"](%_1.10)
  %bias.22 : Tensor = prim::GetAttr[name="bias"](%_1.10)
   = prim::If(%training.17) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %219 : int[] = aten::size(%input0.13) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.9 : int = aten::__getitem__(%219, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %221 : int = aten::len(%219) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %222 : int = aten::sub(%221, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.19 : int = prim::Loop(%222, %67, %size_prods.9) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.9 : int, %size_prods0.21 : int):
          %226 : int = aten::add(%i.9, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %227 : int = aten::__getitem__(%219, %226) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.9 : int = aten::mul(%size_prods0.21, %227) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.9)
      %229 : bool = aten::eq(%size_prods0.19, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%229) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %230 : str = aten::format(%65, %219) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%230, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.11 : Tensor = aten::batch_norm(%input0.13, %weight.22, %bias.22, %running_mean.9, %running_var.9, %training.17, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out.4 : Tensor = aten::gelu(%input1.11, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_1.2)
  %_0.12 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.4)
  %_1.12 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.4)
  %weight.24 : Tensor = prim::GetAttr[name="weight"](%_0.12)
  %bias.24 : Tensor? = prim::GetAttr[name="bias"](%_0.12)
  %238 : int[] = prim::ListConstruct(%60, %60)
  %239 : int[] = prim::ListConstruct(%60, %60)
  %240 : int[] = prim::ListConstruct(%60, %60)
  %input0.15 : Tensor = aten::conv2d(%out.4, %weight.24, %bias.24, %238, %239, %240, %69) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.19 : bool = prim::GetAttr[name="training"](%_1.12)
   = prim::If(%training.19) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.11 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.12)
      %244 : Tensor = aten::add_(%num_batches_tracked.11, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.21 : bool = prim::GetAttr[name="training"](%_1.12)
  %running_mean.11 : Tensor = prim::GetAttr[name="running_mean"](%_1.12)
  %running_var.11 : Tensor = prim::GetAttr[name="running_var"](%_1.12)
  %weight.26 : Tensor = prim::GetAttr[name="weight"](%_1.12)
  %bias.26 : Tensor = prim::GetAttr[name="bias"](%_1.12)
   = prim::If(%training.21) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %250 : int[] = aten::size(%input0.15) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.11 : int = aten::__getitem__(%250, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %252 : int = aten::len(%250) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %253 : int = aten::sub(%252, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.23 : int = prim::Loop(%253, %67, %size_prods.11) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.11 : int, %size_prods0.25 : int):
          %257 : int = aten::add(%i.11, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %258 : int = aten::__getitem__(%250, %257) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.11 : int = aten::mul(%size_prods0.25, %258) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.11)
      %260 : bool = aten::eq(%size_prods0.23, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%260) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %261 : str = aten::format(%65, %250) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%261, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.13 : Tensor = aten::batch_norm(%input0.15, %weight.26, %bias.26, %running_mean.11, %running_var.11, %training.21, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out0.4 : Tensor = aten::gelu(%input1.13, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %se.4 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_1.2)
  %265 : int[] = prim::ListConstruct(%66, %70)
  %y.4 : Tensor = aten::mean(%out0.4, %265, %67, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.4 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc1"](%se.4)
  %weight.28 : Tensor = prim::GetAttr[name="weight"](%fc1.4)
  %bias.28 : Tensor? = prim::GetAttr[name="bias"](%fc1.4)
  %270 : int[] = prim::ListConstruct(%60, %60)
  %271 : int[] = prim::ListConstruct(%68, %68)
  %272 : int[] = prim::ListConstruct(%60, %60)
  %y0.4 : Tensor = aten::conv2d(%y.4, %weight.28, %bias.28, %270, %271, %272, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act1.4 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.4)
  %y1.4 : Tensor = aten::gelu(%y0.4, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %fc2.4 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc2"](%se.4)
  %weight.30 : Tensor = prim::GetAttr[name="weight"](%fc2.4)
  %bias.30 : Tensor? = prim::GetAttr[name="bias"](%fc2.4)
  %279 : int[] = prim::ListConstruct(%60, %60)
  %280 : int[] = prim::ListConstruct(%68, %68)
  %281 : int[] = prim::ListConstruct(%60, %60)
  %y2.4 : Tensor = aten::conv2d(%y1.4, %weight.30, %bias.30, %279, %280, %281, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act2.4 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.4)
  %y3.4 : Tensor = aten::sigmoid(%y2.4) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:327:15
  %out1.4 : Tensor = aten::mul(%out0.4, %y3.4) # /home/auto_update_valid_train.py:42:15
  %project_conv.4 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="project_conv"](%_1.2)
  %_0.14 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%project_conv.4)
  %_1.14 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.4)
  %weight.32 : Tensor = prim::GetAttr[name="weight"](%_0.14)
  %bias.32 : Tensor? = prim::GetAttr[name="bias"](%_0.14)
  %291 : int[] = prim::ListConstruct(%60, %60)
  %292 : int[] = prim::ListConstruct(%68, %68)
  %293 : int[] = prim::ListConstruct(%60, %60)
  %input0.17 : Tensor = aten::conv2d(%out1.4, %weight.32, %bias.32, %291, %292, %293, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.23 : bool = prim::GetAttr[name="training"](%_1.14)
   = prim::If(%training.23) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.13 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.14)
      %297 : Tensor = aten::add_(%num_batches_tracked.13, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.25 : bool = prim::GetAttr[name="training"](%_1.14)
  %running_mean.13 : Tensor = prim::GetAttr[name="running_mean"](%_1.14)
  %running_var.13 : Tensor = prim::GetAttr[name="running_var"](%_1.14)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%_1.14)
  %bias.34 : Tensor = prim::GetAttr[name="bias"](%_1.14)
   = prim::If(%training.25) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %303 : int[] = aten::size(%input0.17) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.13 : int = aten::__getitem__(%303, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %305 : int = aten::len(%303) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %306 : int = aten::sub(%305, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.27 : int = prim::Loop(%306, %67, %size_prods.13) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.13 : int, %size_prods0.29 : int):
          %310 : int = aten::add(%i.13, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %311 : int = aten::__getitem__(%303, %310) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.13 : int = aten::mul(%size_prods0.29, %311) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.13)
      %313 : bool = aten::eq(%size_prods0.27, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%313) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %314 : str = aten::format(%65, %303) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%314, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.4 : Tensor = aten::batch_norm(%input0.17, %weight.34, %bias.34, %running_mean.13, %running_var.13, %training.25, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %use_residual.4 : bool = prim::GetAttr[name="use_residual"](%_1.2)
  %input1.3 : Tensor = prim::If(%use_residual.4) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.4 : Tensor = aten::add(%out2.4, %input0.3, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.4)
    block1():
      -> (%out2.4)
  %expand_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_2)
  %_0.16 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.6)
  %_1.16 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.6)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%_0.16)
  %bias.36 : Tensor? = prim::GetAttr[name="bias"](%_0.16)
  %324 : int[] = prim::ListConstruct(%60, %60)
  %325 : int[] = prim::ListConstruct(%68, %68)
  %326 : int[] = prim::ListConstruct(%60, %60)
  %input0.19 : Tensor = aten::conv2d(%input1.3, %weight.36, %bias.36, %324, %325, %326, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.27 : bool = prim::GetAttr[name="training"](%_1.16)
   = prim::If(%training.27) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.15 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.16)
      %330 : Tensor = aten::add_(%num_batches_tracked.15, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.29 : bool = prim::GetAttr[name="training"](%_1.16)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%_1.16)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%_1.16)
  %weight.38 : Tensor = prim::GetAttr[name="weight"](%_1.16)
  %bias.38 : Tensor = prim::GetAttr[name="bias"](%_1.16)
   = prim::If(%training.29) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %336 : int[] = aten::size(%input0.19) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.15 : int = aten::__getitem__(%336, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %338 : int = aten::len(%336) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %339 : int = aten::sub(%338, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.31 : int = prim::Loop(%339, %67, %size_prods.15) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.15 : int, %size_prods0.33 : int):
          %343 : int = aten::add(%i.15, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %344 : int = aten::__getitem__(%336, %343) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.15 : int = aten::mul(%size_prods0.33, %344) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.15)
      %346 : bool = aten::eq(%size_prods0.31, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%346) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %347 : str = aten::format(%65, %336) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%347, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.15 : Tensor = aten::batch_norm(%input0.19, %weight.38, %bias.38, %running_mean.15, %running_var.15, %training.29, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out.6 : Tensor = aten::gelu(%input1.15, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %depthwise_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_4.Sequential = prim::GetAttr[name="depthwise_conv"](%_2)
  %_0.18 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%depthwise_conv.6)
  %_1.18 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%depthwise_conv.6)
  %weight.40 : Tensor = prim::GetAttr[name="weight"](%_0.18)
  %bias.40 : Tensor? = prim::GetAttr[name="bias"](%_0.18)
  %355 : int[] = prim::ListConstruct(%60, %60)
  %356 : int[] = prim::ListConstruct(%60, %60)
  %357 : int[] = prim::ListConstruct(%60, %60)
  %input0.21 : Tensor = aten::conv2d(%out.6, %weight.40, %bias.40, %355, %356, %357, %69) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.31 : bool = prim::GetAttr[name="training"](%_1.18)
   = prim::If(%training.31) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.17 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.18)
      %361 : Tensor = aten::add_(%num_batches_tracked.17, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.33 : bool = prim::GetAttr[name="training"](%_1.18)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%_1.18)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%_1.18)
  %weight.42 : Tensor = prim::GetAttr[name="weight"](%_1.18)
  %bias.42 : Tensor = prim::GetAttr[name="bias"](%_1.18)
   = prim::If(%training.33) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %367 : int[] = aten::size(%input0.21) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.17 : int = aten::__getitem__(%367, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %369 : int = aten::len(%367) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %370 : int = aten::sub(%369, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.35 : int = prim::Loop(%370, %67, %size_prods.17) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.17 : int, %size_prods0.37 : int):
          %374 : int = aten::add(%i.17, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %375 : int = aten::__getitem__(%367, %374) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.17 : int = aten::mul(%size_prods0.37, %375) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.17)
      %377 : bool = aten::eq(%size_prods0.35, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%377) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %378 : str = aten::format(%65, %367) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%378, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.17 : Tensor = aten::batch_norm(%input0.21, %weight.42, %bias.42, %running_mean.17, %running_var.17, %training.33, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %out0.6 : Tensor = aten::gelu(%input1.17, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %se.6 : __torch__.SqueezeExcite = prim::GetAttr[name="se"](%_2)
  %382 : int[] = prim::ListConstruct(%66, %70)
  %y.6 : Tensor = aten::mean(%out0.6, %382, %67, %71) # /home/auto_update_valid_train.py:37:12
  %fc1.6 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc1"](%se.6)
  %weight.44 : Tensor = prim::GetAttr[name="weight"](%fc1.6)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%fc1.6)
  %387 : int[] = prim::ListConstruct(%60, %60)
  %388 : int[] = prim::ListConstruct(%68, %68)
  %389 : int[] = prim::ListConstruct(%60, %60)
  %y0.6 : Tensor = aten::conv2d(%y.6, %weight.44, %bias.44, %387, %388, %389, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act1.6 : __torch__.torch.nn.modules.activation.GELU = prim::GetAttr[name="act1"](%se.6)
  %y1.6 : Tensor = aten::gelu(%y0.6, %61) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:734:15
  %fc2.6 : __torch__.torch.nn.modules.conv.___torch_mangle_5.Conv2d = prim::GetAttr[name="fc2"](%se.6)
  %weight.46 : Tensor = prim::GetAttr[name="weight"](%fc2.6)
  %bias.46 : Tensor? = prim::GetAttr[name="bias"](%fc2.6)
  %396 : int[] = prim::ListConstruct(%60, %60)
  %397 : int[] = prim::ListConstruct(%68, %68)
  %398 : int[] = prim::ListConstruct(%60, %60)
  %y2.6 : Tensor = aten::conv2d(%y1.6, %weight.46, %bias.46, %396, %397, %398, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %act2.6 : __torch__.torch.nn.modules.activation.Sigmoid = prim::GetAttr[name="act2"](%se.6)
  %y3.6 : Tensor = aten::sigmoid(%y2.6) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/activation.py:327:15
  %out1.6 : Tensor = aten::mul(%out0.6, %y3.6) # /home/auto_update_valid_train.py:42:15
  %project_conv.6 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="project_conv"](%_2)
  %_0.20 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%project_conv.6)
  %_1.20 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%project_conv.6)
  %weight.48 : Tensor = prim::GetAttr[name="weight"](%_0.20)
  %bias.48 : Tensor? = prim::GetAttr[name="bias"](%_0.20)
  %408 : int[] = prim::ListConstruct(%60, %60)
  %409 : int[] = prim::ListConstruct(%68, %68)
  %410 : int[] = prim::ListConstruct(%60, %60)
  %input0.23 : Tensor = aten::conv2d(%out1.6, %weight.48, %bias.48, %408, %409, %410, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.35 : bool = prim::GetAttr[name="training"](%_1.20)
   = prim::If(%training.35) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.19 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.20)
      %414 : Tensor = aten::add_(%num_batches_tracked.19, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.37 : bool = prim::GetAttr[name="training"](%_1.20)
  %running_mean.19 : Tensor = prim::GetAttr[name="running_mean"](%_1.20)
  %running_var.19 : Tensor = prim::GetAttr[name="running_var"](%_1.20)
  %weight.50 : Tensor = prim::GetAttr[name="weight"](%_1.20)
  %bias.50 : Tensor = prim::GetAttr[name="bias"](%_1.20)
   = prim::If(%training.37) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %420 : int[] = aten::size(%input0.23) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.19 : int = aten::__getitem__(%420, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %422 : int = aten::len(%420) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %423 : int = aten::sub(%422, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.39 : int = prim::Loop(%423, %67, %size_prods.19) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:4
        block0(%i.19 : int, %size_prods0.41 : int):
          %427 : int = aten::add(%i.19, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:27
          %428 : int = aten::__getitem__(%420, %427) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.19 : int = aten::mul(%size_prods0.41, %428) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2774:8
          -> (%67, %size_prods1.19)
      %430 : bool = aten::eq(%size_prods0.39, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%430) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2775:4
        block0():
          %431 : str = aten::format(%65, %420) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%431, %64) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out2.6 : Tensor = aten::batch_norm(%input0.23, %weight.50, %bias.50, %running_mean.19, %running_var.19, %training.37, %62, %63, %67) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2812:11
  %use_residual.6 : bool = prim::GetAttr[name="use_residual"](%_2)
  %input2.1 : Tensor = prim::If(%use_residual.6) # /home/auto_update_valid_train.py:260:8
    block0():
      %out3.6 : Tensor = aten::add(%out2.6, %input1.3, %60) # /home/auto_update_valid_train.py:262:18
      -> (%out3.6)
    block1():
      -> (%out2.6)
  %expand_conv.8 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="expand_conv"](%_3)
  %_0.22 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%expand_conv.8)
  %_1.22 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%expand_conv.8)
  %weight.52 : Tensor = prim::GetAttr[name="weight"](%_0.22)
  %bias.52 : Tensor? = prim::GetAttr[name="bias"](%_0.22)
  %441 : int[] = prim::ListConstruct(%60, %60)
  %442 : int[] = prim::ListConstruct(%68, %68)
  %443 : int[] = prim::ListConstruct(%60, %60)
  %input0.25 : Tensor = aten::conv2d(%input2.1, %weight.52, %bias.52, %441, %442, %443, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/conv.py:549:15
  %training.39 : bool = prim::GetAttr[name="training"](%_1.22)
   = prim::If(%training.39) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.21 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.22)
      %447 : Tensor = aten::add_(%num_batches_tracked.21, %60, %60) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.41 : bool = prim::GetAttr[name="training"](%_1.22)
  %running_mean.21 : Tensor = prim::GetAttr[name="running_mean"](%_1.22)
  %running_var.21 : Tensor = prim::GetAttr[name="running_var"](%_1.22)
  %weight.54 : Tensor = prim::GetAttr[name="weight"](%_1.22)
  %bias.54 : Tensor = prim::GetAttr[name="bias"](%_1.22)
   = prim::If(%training.41) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2809:4
    block0():
      %453 : int[] = aten::size(%input0.25) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2810:27
      %size_prods.21 : int = aten::__getitem__(%453, %68) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2772:17
      %455 : int = aten::len(%453) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
      %456 : int = aten::sub(%455, %66) # /root/miniconda3/lib/python3.12/site-packages/torch/nn/functional.py:2773:19
