graph(%self.1 : __torch__.selfic.squeezenet.SqueezeNet,
      %x.1 : Tensor):
  %2 : int = prim::Constant[value=1]()
  %3 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/selfic/squeezenet.py:92:26
  %4 : int = prim::Constant[value=-1]() # /workspace/ImageGenetic/selfic/squeezenet.py:92:30
  %stem.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="stem"](%self.1)
  %37 : bool = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/pooling.py:219:22
  %38 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %39 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %40 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %41 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %42 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:22
  %43 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %44 : bool = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %45 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:33
  %_0.2 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="0"](%stem.1)
  %_1.2 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%stem.1)
  %weight.4 : Tensor = prim::GetAttr[name="weight"](%_0.2)
  %bias.4 : Tensor? = prim::GetAttr[name="bias"](%_0.2)
  %50 : int[] = prim::ListConstruct(%45, %45)
  %51 : int[] = prim::ListConstruct(%45, %45)
  %52 : int[] = prim::ListConstruct(%45, %45)
  %input0.3 : Tensor = aten::conv2d(%x.1, %weight.4, %bias.4, %50, %51, %52, %45) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.3 : bool = prim::GetAttr[name="training"](%_1.2)
   = prim::If(%training.3) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.3 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.2)
      %56 : Tensor = aten::add_(%num_batches_tracked.3, %45, %45) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.5 : bool = prim::GetAttr[name="training"](%_1.2)
  %running_mean.3 : Tensor = prim::GetAttr[name="running_mean"](%_1.2)
  %running_var.3 : Tensor = prim::GetAttr[name="running_var"](%_1.2)
  %weight.6 : Tensor = prim::GetAttr[name="weight"](%_1.2)
  %bias.6 : Tensor = prim::GetAttr[name="bias"](%_1.2)
   = prim::If(%training.5) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %62 : int[] = aten::size(%input0.3) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.3 : int = aten::__getitem__(%62, %42) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %64 : int = aten::len(%62) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %65 : int = aten::sub(%64, %43) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.2 : int = prim::Loop(%65, %44, %size_prods.3) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.3 : int, %size_prods0.9 : int):
          %69 : int = aten::add(%i.3, %43) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %70 : int = aten::__getitem__(%62, %69) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.3 : int = aten::mul(%size_prods0.9, %70) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%44, %size_prods1.3)
      %72 : bool = aten::eq(%size_prods0.2, %45) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%72) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %73 : str = aten::format(%41, %62) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%73, %40) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.3 : Tensor = aten::batch_norm(%input0.3, %weight.6, %bias.6, %running_mean.3, %running_var.3, %training.5, %38, %39, %44) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %input2.1 : Tensor = aten::relu_(%input1.3) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %76 : int[] = prim::ListConstruct(%43, %43)
  %77 : int[] = prim::ListConstruct(%43, %43)
  %78 : int[] = prim::ListConstruct(%42, %42)
  %79 : int[] = prim::ListConstruct(%45, %45)
  %x0.4 : Tensor = aten::max_pool2d(%input2.1, %76, %77, %78, %79, %37) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:830:11
  %fire2.1 : __torch__.selfic.squeezenet.Fire = prim::GetAttr[name="fire2"](%self.1)
  %81 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %82 : bool = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %83 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %84 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %85 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %86 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %87 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %88 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/selfic/squeezenet.py:44:11
  %squeeze.2 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="squeeze"](%fire2.1)
  %_0.4 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%squeeze.2)
  %_1.4 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%squeeze.2)
  %weight.8 : Tensor = prim::GetAttr[name="weight"](%_0.4)
  %bias.8 : Tensor? = prim::GetAttr[name="bias"](%_0.4)
  %94 : int[] = prim::ListConstruct(%88, %88)
  %95 : int[] = prim::ListConstruct(%81, %81)
  %96 : int[] = prim::ListConstruct(%88, %88)
  %input0.5 : Tensor = aten::conv2d(%x0.4, %weight.8, %bias.8, %94, %95, %96, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.7 : bool = prim::GetAttr[name="training"](%_1.4)
   = prim::If(%training.7) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.5 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.4)
      %100 : Tensor = aten::add_(%num_batches_tracked.5, %88, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.9 : bool = prim::GetAttr[name="training"](%_1.4)
  %running_mean.5 : Tensor = prim::GetAttr[name="running_mean"](%_1.4)
  %running_var.5 : Tensor = prim::GetAttr[name="running_var"](%_1.4)
  %weight.10 : Tensor = prim::GetAttr[name="weight"](%_1.4)
  %bias.10 : Tensor = prim::GetAttr[name="bias"](%_1.4)
   = prim::If(%training.9) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %106 : int[] = aten::size(%input0.5) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.5 : int = aten::__getitem__(%106, %81) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %108 : int = aten::len(%106) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %109 : int = aten::sub(%108, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.11 : int = prim::Loop(%109, %82, %size_prods.5) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.5 : int, %size_prods0.13 : int):
          %113 : int = aten::add(%i.5, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %114 : int = aten::__getitem__(%106, %113) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.5 : int = aten::mul(%size_prods0.13, %114) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%82, %size_prods1.5)
      %116 : bool = aten::eq(%size_prods0.11, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%116) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %117 : str = aten::format(%84, %106) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%117, %85) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.5 : Tensor = aten::batch_norm(%input0.5, %weight.10, %bias.10, %running_mean.5, %running_var.5, %training.9, %87, %86, %82) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %x3.1 : Tensor = aten::relu_(%input1.5) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_1x1.2 : __torch__.torch.nn.modules.container.___torch_mangle_5.Sequential = prim::GetAttr[name="expand_1x1"](%fire2.1)
  %_0.6 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%expand_1x1.2)
  %_1.6 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_4.BatchNorm2d = prim::GetAttr[name="1"](%expand_1x1.2)
  %weight.12 : Tensor = prim::GetAttr[name="weight"](%_0.6)
  %bias.12 : Tensor? = prim::GetAttr[name="bias"](%_0.6)
  %125 : int[] = prim::ListConstruct(%88, %88)
  %126 : int[] = prim::ListConstruct(%81, %81)
  %127 : int[] = prim::ListConstruct(%88, %88)
  %input0.7 : Tensor = aten::conv2d(%x3.1, %weight.12, %bias.12, %125, %126, %127, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.11 : bool = prim::GetAttr[name="training"](%_1.6)
   = prim::If(%training.11) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.7 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.6)
      %131 : Tensor = aten::add_(%num_batches_tracked.7, %88, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.13 : bool = prim::GetAttr[name="training"](%_1.6)
  %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%_1.6)
  %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%_1.6)
  %weight.14 : Tensor = prim::GetAttr[name="weight"](%_1.6)
  %bias.14 : Tensor = prim::GetAttr[name="bias"](%_1.6)
   = prim::If(%training.13) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %137 : int[] = aten::size(%input0.7) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.7 : int = aten::__getitem__(%137, %81) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %139 : int = aten::len(%137) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %140 : int = aten::sub(%139, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.15 : int = prim::Loop(%140, %82, %size_prods.7) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.7 : int, %size_prods0.17 : int):
          %144 : int = aten::add(%i.7, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %145 : int = aten::__getitem__(%137, %144) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.7 : int = aten::mul(%size_prods0.17, %145) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%82, %size_prods1.7)
      %147 : bool = aten::eq(%size_prods0.15, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%147) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %148 : str = aten::format(%84, %137) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%148, %85) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.7 : Tensor = aten::batch_norm(%input0.7, %weight.14, %bias.14, %running_mean.7, %running_var.7, %training.13, %87, %86, %82) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.3 : Tensor = aten::relu_(%input1.7) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_3x3.2 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="expand_3x3"](%fire2.1)
  %_0.8 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%expand_3x3.2)
  %_1.8 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_4.BatchNorm2d = prim::GetAttr[name="1"](%expand_3x3.2)
  %weight.16 : Tensor = prim::GetAttr[name="weight"](%_0.8)
  %bias.16 : Tensor? = prim::GetAttr[name="bias"](%_0.8)
  %156 : int[] = prim::ListConstruct(%88, %88)
  %157 : int[] = prim::ListConstruct(%88, %88)
  %158 : int[] = prim::ListConstruct(%88, %88)
  %input0.9 : Tensor = aten::conv2d(%x3.1, %weight.16, %bias.16, %156, %157, %158, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.15 : bool = prim::GetAttr[name="training"](%_1.8)
   = prim::If(%training.15) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.9 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.8)
      %162 : Tensor = aten::add_(%num_batches_tracked.9, %88, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.17 : bool = prim::GetAttr[name="training"](%_1.8)
  %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%_1.8)
  %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%_1.8)
  %weight.18 : Tensor = prim::GetAttr[name="weight"](%_1.8)
  %bias.18 : Tensor = prim::GetAttr[name="bias"](%_1.8)
   = prim::If(%training.17) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %168 : int[] = aten::size(%input0.9) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.9 : int = aten::__getitem__(%168, %81) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %170 : int = aten::len(%168) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %171 : int = aten::sub(%170, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.19 : int = prim::Loop(%171, %82, %size_prods.9) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.9 : int, %size_prods0.21 : int):
          %175 : int = aten::add(%i.9, %83) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %176 : int = aten::__getitem__(%168, %175) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.9 : int = aten::mul(%size_prods0.21, %176) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%82, %size_prods1.9)
      %178 : bool = aten::eq(%size_prods0.19, %88) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%178) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %179 : str = aten::format(%84, %168) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%179, %85) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.9 : Tensor = aten::batch_norm(%input0.9, %weight.18, %bias.18, %running_mean.9, %running_var.9, %training.17, %87, %86, %82) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.5 : Tensor = aten::relu_(%input1.9) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %182 : Tensor[] = prim::ListConstruct(%result.3, %result.5)
  %f2.1 : Tensor = aten::cat(%182, %88) # /workspace/ImageGenetic/selfic/squeezenet.py:41:12
  %fire3.1 : __torch__.selfic.squeezenet.___torch_mangle_10.Fire = prim::GetAttr[name="fire3"](%self.1)
  %184 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %185 : bool = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %186 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %187 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %188 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %189 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %190 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %191 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/selfic/squeezenet.py:44:11
  %squeeze.4 : __torch__.torch.nn.modules.container.___torch_mangle_9.Sequential = prim::GetAttr[name="squeeze"](%fire3.1)
  %_0.10 : __torch__.torch.nn.modules.conv.___torch_mangle_8.Conv2d = prim::GetAttr[name="0"](%squeeze.4)
  %_1.10 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%squeeze.4)
  %weight.20 : Tensor = prim::GetAttr[name="weight"](%_0.10)
  %bias.20 : Tensor? = prim::GetAttr[name="bias"](%_0.10)
  %197 : int[] = prim::ListConstruct(%191, %191)
  %198 : int[] = prim::ListConstruct(%184, %184)
  %199 : int[] = prim::ListConstruct(%191, %191)
  %input0.11 : Tensor = aten::conv2d(%f2.1, %weight.20, %bias.20, %197, %198, %199, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.19 : bool = prim::GetAttr[name="training"](%_1.10)
   = prim::If(%training.19) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.11 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.10)
      %203 : Tensor = aten::add_(%num_batches_tracked.11, %191, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.21 : bool = prim::GetAttr[name="training"](%_1.10)
  %running_mean.11 : Tensor = prim::GetAttr[name="running_mean"](%_1.10)
  %running_var.11 : Tensor = prim::GetAttr[name="running_var"](%_1.10)
  %weight.22 : Tensor = prim::GetAttr[name="weight"](%_1.10)
  %bias.22 : Tensor = prim::GetAttr[name="bias"](%_1.10)
   = prim::If(%training.21) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %209 : int[] = aten::size(%input0.11) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.11 : int = aten::__getitem__(%209, %184) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %211 : int = aten::len(%209) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %212 : int = aten::sub(%211, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.23 : int = prim::Loop(%212, %185, %size_prods.11) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.11 : int, %size_prods0.25 : int):
          %216 : int = aten::add(%i.11, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %217 : int = aten::__getitem__(%209, %216) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.11 : int = aten::mul(%size_prods0.25, %217) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%185, %size_prods1.11)
      %219 : bool = aten::eq(%size_prods0.23, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%219) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %220 : str = aten::format(%187, %209) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%220, %188) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.11 : Tensor = aten::batch_norm(%input0.11, %weight.22, %bias.22, %running_mean.11, %running_var.11, %training.21, %190, %189, %185) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %x0.6 : Tensor = aten::relu_(%input1.11) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_1x1.4 : __torch__.torch.nn.modules.container.___torch_mangle_5.Sequential = prim::GetAttr[name="expand_1x1"](%fire3.1)
  %_0.12 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="0"](%expand_1x1.4)
  %_1.12 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_4.BatchNorm2d = prim::GetAttr[name="1"](%expand_1x1.4)
  %weight.24 : Tensor = prim::GetAttr[name="weight"](%_0.12)
  %bias.24 : Tensor? = prim::GetAttr[name="bias"](%_0.12)
  %228 : int[] = prim::ListConstruct(%191, %191)
  %229 : int[] = prim::ListConstruct(%184, %184)
  %230 : int[] = prim::ListConstruct(%191, %191)
  %input0.13 : Tensor = aten::conv2d(%x0.6, %weight.24, %bias.24, %228, %229, %230, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.23 : bool = prim::GetAttr[name="training"](%_1.12)
   = prim::If(%training.23) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.13 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.12)
      %234 : Tensor = aten::add_(%num_batches_tracked.13, %191, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.25 : bool = prim::GetAttr[name="training"](%_1.12)
  %running_mean.13 : Tensor = prim::GetAttr[name="running_mean"](%_1.12)
  %running_var.13 : Tensor = prim::GetAttr[name="running_var"](%_1.12)
  %weight.26 : Tensor = prim::GetAttr[name="weight"](%_1.12)
  %bias.26 : Tensor = prim::GetAttr[name="bias"](%_1.12)
   = prim::If(%training.25) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %240 : int[] = aten::size(%input0.13) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.13 : int = aten::__getitem__(%240, %184) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %242 : int = aten::len(%240) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %243 : int = aten::sub(%242, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.27 : int = prim::Loop(%243, %185, %size_prods.13) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.13 : int, %size_prods0.29 : int):
          %247 : int = aten::add(%i.13, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %248 : int = aten::__getitem__(%240, %247) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.13 : int = aten::mul(%size_prods0.29, %248) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%185, %size_prods1.13)
      %250 : bool = aten::eq(%size_prods0.27, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%250) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %251 : str = aten::format(%187, %240) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%251, %188) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.13 : Tensor = aten::batch_norm(%input0.13, %weight.26, %bias.26, %running_mean.13, %running_var.13, %training.25, %190, %189, %185) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.7 : Tensor = aten::relu_(%input1.13) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_3x3.4 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="expand_3x3"](%fire3.1)
  %_0.14 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%expand_3x3.4)
  %_1.14 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_4.BatchNorm2d = prim::GetAttr[name="1"](%expand_3x3.4)
  %weight.28 : Tensor = prim::GetAttr[name="weight"](%_0.14)
  %bias.28 : Tensor? = prim::GetAttr[name="bias"](%_0.14)
  %259 : int[] = prim::ListConstruct(%191, %191)
  %260 : int[] = prim::ListConstruct(%191, %191)
  %261 : int[] = prim::ListConstruct(%191, %191)
  %input0.15 : Tensor = aten::conv2d(%x0.6, %weight.28, %bias.28, %259, %260, %261, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.27 : bool = prim::GetAttr[name="training"](%_1.14)
   = prim::If(%training.27) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.15 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.14)
      %265 : Tensor = aten::add_(%num_batches_tracked.15, %191, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.29 : bool = prim::GetAttr[name="training"](%_1.14)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%_1.14)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%_1.14)
  %weight.30 : Tensor = prim::GetAttr[name="weight"](%_1.14)
  %bias.30 : Tensor = prim::GetAttr[name="bias"](%_1.14)
   = prim::If(%training.29) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %271 : int[] = aten::size(%input0.15) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.15 : int = aten::__getitem__(%271, %184) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %273 : int = aten::len(%271) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %274 : int = aten::sub(%273, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.31 : int = prim::Loop(%274, %185, %size_prods.15) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.15 : int, %size_prods0.33 : int):
          %278 : int = aten::add(%i.15, %186) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %279 : int = aten::__getitem__(%271, %278) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.15 : int = aten::mul(%size_prods0.33, %279) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%185, %size_prods1.15)
      %281 : bool = aten::eq(%size_prods0.31, %191) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%281) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %282 : str = aten::format(%187, %271) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%282, %188) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.15 : Tensor = aten::batch_norm(%input0.15, %weight.30, %bias.30, %running_mean.15, %running_var.15, %training.29, %190, %189, %185) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.9 : Tensor = aten::relu_(%input1.15) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %285 : Tensor[] = prim::ListConstruct(%result.7, %result.9)
  %x1.4 : Tensor = aten::cat(%285, %191) # /workspace/ImageGenetic/selfic/squeezenet.py:41:12
  %f3.1 : Tensor = aten::add(%x1.4, %f2.1, %2) # /workspace/ImageGenetic/selfic/squeezenet.py:78:13
  %fire4.1 : __torch__.selfic.squeezenet.___torch_mangle_19.Fire = prim::GetAttr[name="fire4"](%self.1)
  %287 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %288 : bool = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %289 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %290 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %291 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %292 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %293 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %294 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/selfic/squeezenet.py:44:11
  %squeeze.6 : __torch__.torch.nn.modules.container.___torch_mangle_13.Sequential = prim::GetAttr[name="squeeze"](%fire4.1)
  %_0.16 : __torch__.torch.nn.modules.conv.___torch_mangle_11.Conv2d = prim::GetAttr[name="0"](%squeeze.6)
  %_1.16 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_12.BatchNorm2d = prim::GetAttr[name="1"](%squeeze.6)
  %weight.32 : Tensor = prim::GetAttr[name="weight"](%_0.16)
  %bias.32 : Tensor? = prim::GetAttr[name="bias"](%_0.16)
  %300 : int[] = prim::ListConstruct(%294, %294)
  %301 : int[] = prim::ListConstruct(%287, %287)
  %302 : int[] = prim::ListConstruct(%294, %294)
  %input0.17 : Tensor = aten::conv2d(%f3.1, %weight.32, %bias.32, %300, %301, %302, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.31 : bool = prim::GetAttr[name="training"](%_1.16)
   = prim::If(%training.31) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.17 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.16)
      %306 : Tensor = aten::add_(%num_batches_tracked.17, %294, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.33 : bool = prim::GetAttr[name="training"](%_1.16)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%_1.16)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%_1.16)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%_1.16)
  %bias.34 : Tensor = prim::GetAttr[name="bias"](%_1.16)
   = prim::If(%training.33) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %312 : int[] = aten::size(%input0.17) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.17 : int = aten::__getitem__(%312, %287) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %314 : int = aten::len(%312) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %315 : int = aten::sub(%314, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.35 : int = prim::Loop(%315, %288, %size_prods.17) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.17 : int, %size_prods0.37 : int):
          %319 : int = aten::add(%i.17, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %320 : int = aten::__getitem__(%312, %319) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.17 : int = aten::mul(%size_prods0.37, %320) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%288, %size_prods1.17)
      %322 : bool = aten::eq(%size_prods0.35, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%322) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %323 : str = aten::format(%290, %312) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%323, %291) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.17 : Tensor = aten::batch_norm(%input0.17, %weight.34, %bias.34, %running_mean.17, %running_var.17, %training.33, %293, %292, %288) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %x0.8 : Tensor = aten::relu_(%input1.17) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_1x1.6 : __torch__.torch.nn.modules.container.___torch_mangle_16.Sequential = prim::GetAttr[name="expand_1x1"](%fire4.1)
  %_0.18 : __torch__.torch.nn.modules.conv.___torch_mangle_14.Conv2d = prim::GetAttr[name="0"](%expand_1x1.6)
  %_1.18 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_15.BatchNorm2d = prim::GetAttr[name="1"](%expand_1x1.6)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%_0.18)
  %bias.36 : Tensor? = prim::GetAttr[name="bias"](%_0.18)
  %331 : int[] = prim::ListConstruct(%294, %294)
  %332 : int[] = prim::ListConstruct(%287, %287)
  %333 : int[] = prim::ListConstruct(%294, %294)
  %input0.19 : Tensor = aten::conv2d(%x0.8, %weight.36, %bias.36, %331, %332, %333, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.35 : bool = prim::GetAttr[name="training"](%_1.18)
   = prim::If(%training.35) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.19 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.18)
      %337 : Tensor = aten::add_(%num_batches_tracked.19, %294, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.37 : bool = prim::GetAttr[name="training"](%_1.18)
  %running_mean.19 : Tensor = prim::GetAttr[name="running_mean"](%_1.18)
  %running_var.19 : Tensor = prim::GetAttr[name="running_var"](%_1.18)
  %weight.38 : Tensor = prim::GetAttr[name="weight"](%_1.18)
  %bias.38 : Tensor = prim::GetAttr[name="bias"](%_1.18)
   = prim::If(%training.37) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %343 : int[] = aten::size(%input0.19) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.19 : int = aten::__getitem__(%343, %287) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %345 : int = aten::len(%343) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %346 : int = aten::sub(%345, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.39 : int = prim::Loop(%346, %288, %size_prods.19) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.19 : int, %size_prods0.41 : int):
          %350 : int = aten::add(%i.19, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %351 : int = aten::__getitem__(%343, %350) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.19 : int = aten::mul(%size_prods0.41, %351) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%288, %size_prods1.19)
      %353 : bool = aten::eq(%size_prods0.39, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%353) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %354 : str = aten::format(%290, %343) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%354, %291) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.19 : Tensor = aten::batch_norm(%input0.19, %weight.38, %bias.38, %running_mean.19, %running_var.19, %training.37, %293, %292, %288) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.11 : Tensor = aten::relu_(%input1.19) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %expand_3x3.6 : __torch__.torch.nn.modules.container.___torch_mangle_18.Sequential = prim::GetAttr[name="expand_3x3"](%fire4.1)
  %_0.20 : __torch__.torch.nn.modules.conv.___torch_mangle_17.Conv2d = prim::GetAttr[name="0"](%expand_3x3.6)
  %_1.20 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_15.BatchNorm2d = prim::GetAttr[name="1"](%expand_3x3.6)
  %weight.40 : Tensor = prim::GetAttr[name="weight"](%_0.20)
  %bias.40 : Tensor? = prim::GetAttr[name="bias"](%_0.20)
  %362 : int[] = prim::ListConstruct(%294, %294)
  %363 : int[] = prim::ListConstruct(%294, %294)
  %364 : int[] = prim::ListConstruct(%294, %294)
  %input0.21 : Tensor = aten::conv2d(%x0.8, %weight.40, %bias.40, %362, %363, %364, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.39 : bool = prim::GetAttr[name="training"](%_1.20)
   = prim::If(%training.39) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.21 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.20)
      %368 : Tensor = aten::add_(%num_batches_tracked.21, %294, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.41 : bool = prim::GetAttr[name="training"](%_1.20)
  %running_mean.21 : Tensor = prim::GetAttr[name="running_mean"](%_1.20)
  %running_var.21 : Tensor = prim::GetAttr[name="running_var"](%_1.20)
  %weight.42 : Tensor = prim::GetAttr[name="weight"](%_1.20)
  %bias.42 : Tensor = prim::GetAttr[name="bias"](%_1.20)
   = prim::If(%training.41) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %374 : int[] = aten::size(%input0.21) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.21 : int = aten::__getitem__(%374, %287) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %376 : int = aten::len(%374) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %377 : int = aten::sub(%376, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
      %size_prods0.43 : int = prim::Loop(%377, %288, %size_prods.21) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:4
        block0(%i.21 : int, %size_prods0.45 : int):
          %381 : int = aten::add(%i.21, %289) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:27
          %382 : int = aten::__getitem__(%374, %381) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:22
          %size_prods1.21 : int = aten::mul(%size_prods0.45, %382) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2774:8
          -> (%288, %size_prods1.21)
      %384 : bool = aten::eq(%size_prods0.43, %294) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:7
       = prim::If(%384) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2775:4
        block0():
          %385 : str = aten::format(%290, %374) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
           = prim::RaiseException(%385, %291) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2776:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %input1.21 : Tensor = aten::batch_norm(%input0.21, %weight.42, %bias.42, %running_mean.21, %running_var.21, %training.41, %293, %292, %288) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2812:11
  %result.13 : Tensor = aten::relu_(%input1.21) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:1702:17
  %388 : Tensor[] = prim::ListConstruct(%result.11, %result.13)
  %f4.1 : Tensor = aten::cat(%388, %294) # /workspace/ImageGenetic/selfic/squeezenet.py:41:12
  %maxpool.1 : __torch__.torch.nn.modules.pooling.MaxPool2d = prim::GetAttr[name="maxpool"](%self.1)
  %390 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/pooling.py:218:12
  %391 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/pooling.py:217:12
  %392 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/pooling.py:215:12
  %393 : bool = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/pooling.py:219:22
  %394 : int[] = prim::ListConstruct(%392, %392)
  %395 : int[] = prim::ListConstruct(%392, %392)
  %396 : int[] = prim::ListConstruct(%391, %391)
  %397 : int[] = prim::ListConstruct(%390, %390)
  %f40.1 : Tensor = aten::max_pool2d(%f4.1, %394, %395, %396, %397, %393) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:830:11
  %fire5.1 : __torch__.selfic.squeezenet.___torch_mangle_22.Fire = prim::GetAttr[name="fire5"](%self.1)
  %399 : int = prim::Constant[value=0]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:550:46
  %400 : bool = prim::Constant[value=1]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2821:8
  %401 : int = prim::Constant[value=2]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:31
  %402 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2777:12
  %403 : str = prim::Constant[value="builtins.ValueError"]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:452:18
  %404 : float = prim::Constant[value=1.0000000000000001e-05]() # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:204:12
  %405 : float = prim::Constant[value=0.10000000000000001]() # :0:0
  %406 : int = prim::Constant[value=1]() # /workspace/ImageGenetic/selfic/squeezenet.py:44:11
  %squeeze.8 : __torch__.torch.nn.modules.container.___torch_mangle_21.Sequential = prim::GetAttr[name="squeeze"](%fire5.1)
  %_0.22 : __torch__.torch.nn.modules.conv.___torch_mangle_20.Conv2d = prim::GetAttr[name="0"](%squeeze.8)
  %_1.22 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_12.BatchNorm2d = prim::GetAttr[name="1"](%squeeze.8)
  %weight.44 : Tensor = prim::GetAttr[name="weight"](%_0.22)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%_0.22)
  %412 : int[] = prim::ListConstruct(%406, %406)
  %413 : int[] = prim::ListConstruct(%399, %399)
  %414 : int[] = prim::ListConstruct(%406, %406)
  %input0.23 : Tensor = aten::conv2d(%f40.1, %weight.44, %bias.44, %412, %413, %414, %406) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/conv.py:549:15
  %training.43 : bool = prim::GetAttr[name="training"](%_1.22)
   = prim::If(%training.43) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:170:11
    block0():
      %num_batches_tracked.23 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.22)
      %418 : Tensor = aten::add_(%num_batches_tracked.23, %406, %406) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/modules/batchnorm.py:173:16
      -> ()
    block1():
      -> ()
  %training.45 : bool = prim::GetAttr[name="training"](%_1.22)
  %running_mean.23 : Tensor = prim::GetAttr[name="running_mean"](%_1.22)
  %running_var.23 : Tensor = prim::GetAttr[name="running_var"](%_1.22)
  %weight.46 : Tensor = prim::GetAttr[name="weight"](%_1.22)
  %bias.46 : Tensor = prim::GetAttr[name="bias"](%_1.22)
   = prim::If(%training.45) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2809:4
    block0():
      %424 : int[] = aten::size(%input0.23) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2810:27
      %size_prods.23 : int = aten::__getitem__(%424, %399) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2772:17
      %426 : int = aten::len(%424) # /workspace/ImageGenetic/venv/lib/python3.11/site-packages/torch/nn/functional.py:2773:19
